[Killed] BlockStatement
Backend/controllers/adminController.js:10:49
 const announcementModel = require('../model/announcementNote');
 
 //People Page Get All Employee details
-async function handleAllEmployeeDetails(req,res){
-     const allEmpDetails = await employeeModel.find();
-
-     const detailedProfiles = await detailedProfile.find();
-
-     const allEmpDetailsWithProfiles = allEmpDetails.map((employee) => {
-        const profile = detailedProfiles.find((detail) => detail.id === employee.id);
-        return {
-            ...employee._doc, 
-            imageUrl: profile ? profile.profileImage : null, 
-        };
-        
-    });     
-     return res.status(200).send({
-        allEmpDetailsWithProfiles
-    });
-}
+async function handleAllEmployeeDetails(req,res){}
 
 //Delete Employee/HR/Manager by Admin
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/adminController.js:15:72
 
      const detailedProfiles = await detailedProfile.find();
 
-     const allEmpDetailsWithProfiles = allEmpDetails.map((employee) => {
-        const profile = detailedProfiles.find((detail) => detail.id === employee.id);
-        return {
-            ...employee._doc, 
-            imageUrl: profile ? profile.profileImage : null, 
-        };
-        
-    });     
+     const allEmpDetailsWithProfiles = allEmpDetails.map((employee) => {});     
      return res.status(200).send({
         allEmpDetailsWithProfiles
killedBy: Auth Tests [Admin] should successfully logout with valid token
statusReason: Auth token is missing. Login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/adminController.js:16:59
      const detailedProfiles = await detailedProfile.find();
 
      const allEmpDetailsWithProfiles = allEmpDetails.map((employee) => {
-        const profile = detailedProfiles.find((detail) => detail.id === employee.id);
+        const profile = detailedProfiles.find((detail) => false);
         return {
             ...employee._doc, 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] EqualityOperator
Backend/controllers/adminController.js:16:59
      const detailedProfiles = await detailedProfile.find();
 
      const allEmpDetailsWithProfiles = allEmpDetails.map((employee) => {
-        const profile = detailedProfiles.find((detail) => detail.id === employee.id);
+        const profile = detailedProfiles.find((detail) => detail.id !== employee.id);
         return {
             ...employee._doc, 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BooleanLiteral
Backend/controllers/adminController.js:34:13
     const { id } = req.params;  
     try { 
         const employee = await employeeModel.findOne({ id });
-        if (!employee) {
+        if (employee) {
             return res.status(404).json({ message: 'Employee not found' });
         }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/adminController.js:34:13
     const { id } = req.params;  
     try { 
         const employee = await employeeModel.findOne({ id });
-        if (!employee) {
+        if (true) {
             return res.status(404).json({ message: 'Employee not found' });
         }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/adminController.js:40:13
 
         // 1 
         const deletedProfile = await detailedProfile.findOneAndDelete({ id });
-        if (deletedProfile) {
+        if (true) {
             console.log("Deleted Profile: ", deletedProfile);
         } else {
killedBy: Announcement API Tests [Admin] should fail to post an announcement with missing message
statusReason: Auth token is missing.

[Killed] ConditionalExpression
Backend/controllers/adminController.js:40:13
 
         // 1 
         const deletedProfile = await detailedProfile.findOneAndDelete({ id });
-        if (deletedProfile) {
+        if (false) {
             console.log("Deleted Profile: ", deletedProfile);
         } else {
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/adminController.js:41:25
         // 1 
         const deletedProfile = await detailedProfile.findOneAndDelete({ id });
         if (deletedProfile) {
-            console.log("Deleted Profile: ", deletedProfile);
+            console.log("", deletedProfile);
         } else {
             console.log("Profile not found for the given employee ID");
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/adminController.js:42:16
         const deletedProfile = await detailedProfile.findOneAndDelete({ id });
         if (deletedProfile) {
             console.log("Deleted Profile: ", deletedProfile);
-        } else {
-            console.log("Profile not found for the given employee ID");
-        }
+        } else {}
 
         // 2
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/adminController.js:51:13
         console.log(`Deleted ${deletedAttendance.deletedCount} attendance records for employee ID: ${id}`);
 
         // 3 
-        if (employee.role === 'Manager') {
+        if (true) {
             const deletedProjects = await projectModel.deleteMany({ managerId: id });
             console.log(`Deleted ${deletedProjects.deletedCount} projects managed by employee ID: ${id}`);
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/adminController.js:51:42
         console.log(`Deleted ${deletedAttendance.deletedCount} attendance records for employee ID: ${id}`);
 
         // 3 
-        if (employee.role === 'Manager') {
-            const deletedProjects = await projectModel.deleteMany({ managerId: id });
-            console.log(`Deleted ${deletedProjects.deletedCount} projects managed by employee ID: ${id}`);
-        } else {
+        if (employee.role === 'Manager') {} else {
             const updatedProjects = await projectModel.updateMany(
                 { 'teamMembers.id': id },
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/adminController.js:52:67
 
         // 3 
         if (employee.role === 'Manager') {
-            const deletedProjects = await projectModel.deleteMany({ managerId: id });
+            const deletedProjects = await projectModel.deleteMany({});
             console.log(`Deleted ${deletedProjects.deletedCount} projects managed by employee ID: ${id}`);
         } else {
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/adminController.js:53:25
         // 3 
         if (employee.role === 'Manager') {
             const deletedProjects = await projectModel.deleteMany({ managerId: id });
-            console.log(`Deleted ${deletedProjects.deletedCount} projects managed by employee ID: ${id}`);
+            console.log(``);
         } else {
             const updatedProjects = await projectModel.updateMany(
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/adminController.js:54:16
         if (employee.role === 'Manager') {
             const deletedProjects = await projectModel.deleteMany({ managerId: id });
             console.log(`Deleted ${deletedProjects.deletedCount} projects managed by employee ID: ${id}`);
-        } else {
-            const updatedProjects = await projectModel.updateMany(
-                { 'teamMembers.id': id },
-                { $pull: { teamMembers: { id } } }
-            );
-            const updatedTasks = await projectModel.updateMany(
-                { 'tasks.assignedTo.id': id },
-                { $pull: { tasks: { 'assignedTo.id': id } } }
-            );
-        }
+        } else {}
 
         // 4 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/adminController.js:57:41
         } else {
             const updatedProjects = await projectModel.updateMany(
                 { 'teamMembers.id': id },
-                { $pull: { teamMembers: { id } } }
+                { $pull: { teamMembers: {} } }
             );
             const updatedTasks = await projectModel.updateMany(
killedBy: Announcement API Tests [Admin] should fail to post an announcement with missing message
statusReason: Auth token is missing.

[Killed] ObjectLiteral
Backend/controllers/adminController.js:57:26
         } else {
             const updatedProjects = await projectModel.updateMany(
                 { 'teamMembers.id': id },
-                { $pull: { teamMembers: { id } } }
+                { $pull: {} }
             );
             const updatedTasks = await projectModel.updateMany(
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/adminController.js:60:17
                 { $pull: { teamMembers: { id } } }
             );
             const updatedTasks = await projectModel.updateMany(
-                { 'tasks.assignedTo.id': id },
+                {},
                 { $pull: { tasks: { 'assignedTo.id': id } } }
             );
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/adminController.js:61:17
             );
             const updatedTasks = await projectModel.updateMany(
                 { 'tasks.assignedTo.id': id },
-                { $pull: { tasks: { 'assignedTo.id': id } } }
+                {}
             );
         }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/adminController.js:61:35
             );
             const updatedTasks = await projectModel.updateMany(
                 { 'tasks.assignedTo.id': id },
-                { $pull: { tasks: { 'assignedTo.id': id } } }
+                { $pull: { tasks: {} } }
             );
         }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] EqualityOperator
Backend/controllers/adminController.js:66:13
         }
 
         // 4 
-        if (employee.role === 'HR' || employee.role === 'Manager') {
+        if (employee.role !== 'HR' || employee.role === 'Manager') {
             const deletedAnnouncements = await announcementModel.deleteMany({ senderID: id });
         } else {
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/adminController.js:66:13
         }
 
         // 4 
-        if (employee.role === 'HR' || employee.role === 'Manager') {
+        if (true) {
             const deletedAnnouncements = await announcementModel.deleteMany({ senderID: id });
         } else {
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/adminController.js:68:16
         // 4 
         if (employee.role === 'HR' || employee.role === 'Manager') {
             const deletedAnnouncements = await announcementModel.deleteMany({ senderID: id });
-        } else {
-            const updatedAnnouncements = await announcementModel.updateMany(
-                { receiverIDs: id },
-                { $pull: { receiverIDs: id } } 
-            );
-        }
+        } else {}
 
         // 5 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/adminController.js:80:13
 
         // 6 
         const deletedEmployee = await employeeModel.findOneAndDelete({ id });
-        if (deletedEmployee) {
+        if (true) {
             console.log("Deleted Employee: ", deletedEmployee);
         } else {
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/adminController.js:80:30
 
         // 6 
         const deletedEmployee = await employeeModel.findOneAndDelete({ id });
-        if (deletedEmployee) {
-            console.log("Deleted Employee: ", deletedEmployee);
-        } else {
+        if (deletedEmployee) {} else {
             return res.status(404).json({ message: 'Employee not found' });
         }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/adminController.js:82:16
         const deletedEmployee = await employeeModel.findOneAndDelete({ id });
         if (deletedEmployee) {
             console.log("Deleted Employee: ", deletedEmployee);
-        } else {
-            return res.status(404).json({ message: 'Employee not found' });
-        }
+        } else {}
 
         return res.status(200).json({ message: 'Employee and associated data deleted successfully' });
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/adminController.js:86:48
             return res.status(404).json({ message: 'Employee not found' });
         }
 
-        return res.status(200).json({ message: 'Employee and associated data deleted successfully' });
+        return res.status(200).json({ message: "" });
     } catch (error) {
         console.error("Error: ", error);
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/adminController.js:87:21
         }
 
         return res.status(200).json({ message: 'Employee and associated data deleted successfully' });
-    } catch (error) {
-        console.error("Error: ", error);
-        return res.status(500).json({ message: 'Server error while deleting employee' });
-    }
+    } catch (error) {}
 }
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/adminController.js:89:48
         return res.status(200).json({ message: 'Employee and associated data deleted successfully' });
     } catch (error) {
         console.error("Error: ", error);
-        return res.status(500).json({ message: 'Server error while deleting employee' });
+        return res.status(500).json({ message: "" });
     }
 }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.
