[Killed] BlockStatement
Backend/controllers/anncController.js:7:43
 const jwt = require('jsonwebtoken');
 
 //Save Announcement in Database
-async function handleAnnouncement(req,res){
-    try {
-        
-        const { senderID,senderRole, receiverIDs, message } = req.body; 
-        const announcement = new announcementModel({ senderID,senderRole,receiverIDs,message}); 
-        
-        if (!senderID || !senderRole || !receiverIDs || !message) {
-            return res.status(400).send({
-              message: "Missing required fields."
-            });
-          }
-        
-        
-
-        await announcement.save();
-        res.status(200).send({
-            message: announcement
-        }) 
-    } catch (error) {
-        res.status(404).send({
-            message:"error"
-        })
-    }
-}
+async function handleAnnouncement(req,res){}
 
 //View All announcement by IDs get
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/anncController.js:8:9
 
 //Save Announcement in Database
 async function handleAnnouncement(req,res){
-    try {
-        
-        const { senderID,senderRole, receiverIDs, message } = req.body; 
-        const announcement = new announcementModel({ senderID,senderRole,receiverIDs,message}); 
-        
-        if (!senderID || !senderRole || !receiverIDs || !message) {
-            return res.status(400).send({
-              message: "Missing required fields."
-            });
-          }
-        
-        
-
-        await announcement.save();
-        res.status(200).send({
-            message: announcement
-        }) 
-    } catch (error) {
+    try {} catch (error) {
         res.status(404).send({
             message:"error"
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BooleanLiteral
Backend/controllers/anncController.js:13:57
         const { senderID,senderRole, receiverIDs, message } = req.body; 
         const announcement = new announcementModel({ senderID,senderRole,receiverIDs,message}); 
         
-        if (!senderID || !senderRole || !receiverIDs || !message) {
+        if (!senderID || !senderRole || !receiverIDs || message) {
             return res.status(400).send({
               message: "Missing required fields."
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] LogicalOperator
Backend/controllers/anncController.js:13:13
         const { senderID,senderRole, receiverIDs, message } = req.body; 
         const announcement = new announcementModel({ senderID,senderRole,receiverIDs,message}); 
         
-        if (!senderID || !senderRole || !receiverIDs || !message) {
+        if ((!senderID || !senderRole) && !receiverIDs || !message) {
             return res.status(400).send({
               message: "Missing required fields."
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/anncController.js:15:24
         
         if (!senderID || !senderRole || !receiverIDs || !message) {
             return res.status(400).send({
-              message: "Missing required fields."
+              message: ""
             });
           }
killedBy: Announcement API Tests [Admin] should fail to post an announcement with missing message
statusReason: Auth token is missing.

[Killed] ObjectLiteral
Backend/controllers/anncController.js:22:30
         
 
         await announcement.save();
-        res.status(200).send({
-            message: announcement
-        }) 
+        res.status(200).send({}) 
     } catch (error) {
         res.status(404).send({
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/anncController.js:25:21
         res.status(200).send({
             message: announcement
         }) 
-    } catch (error) {
-        res.status(404).send({
-            message:"error"
-        })
-    }
+    } catch (error) {}
 }
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/anncController.js:26:30
             message: announcement
         }) 
     } catch (error) {
-        res.status(404).send({
-            message:"error"
-        })
+        res.status(404).send({})
     }
 }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BooleanLiteral
Backend/controllers/anncController.js:35:9
 //View All announcement by IDs get
 async function handleAnnouncementView(req,res){
     const token = req.cookies.jwt;
-    if (!token) {
+    if (token) {
         return res.status(401).send({
             success: false,
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/anncController.js:35:9
 //View All announcement by IDs get
 async function handleAnnouncementView(req,res){
     const token = req.cookies.jwt;
-    if (!token) {
+    if (false) {
         return res.status(401).send({
             success: false,
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BooleanLiteral
Backend/controllers/anncController.js:37:22
     const token = req.cookies.jwt;
     if (!token) {
         return res.status(401).send({
-            success: false,
+            success: true,
             message: 'Authorization denied.',
         });
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] UnaryOperator
Backend/controllers/anncController.js:45:110
     const verifyemp = jwt.verify(token, process.env.SECRET_KEY);
     const emp = await employeeModel.findById(verifyemp._id); 
     // console.log(emp.id)
-    const announcements = await announcementModel.find({ receiverIDs: { $in: [emp.id] } }).sort({ createdAt: -1 }); 
+    const announcements = await announcementModel.find({ receiverIDs: { $in: [emp.id] } }).sort({ createdAt: +1 }); 
     // console.log(announcements);
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] MethodExpression
Backend/controllers/anncController.js:45:33
     const verifyemp = jwt.verify(token, process.env.SECRET_KEY);
     const emp = await employeeModel.findById(verifyemp._id); 
     // console.log(emp.id)
-    const announcements = await announcementModel.find({ receiverIDs: { $in: [emp.id] } }).sort({ createdAt: -1 }); 
+    const announcements = await announcementModel.find({
+  receiverIDs: {
+    $in: [emp.id]
+  }
+}); 
     // console.log(announcements);
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/anncController.js:48:35
     const announcements = await announcementModel.find({ receiverIDs: { $in: [emp.id] } }).sort({ createdAt: -1 }); 
     // console.log(announcements);
 
-    if (announcements.length > 0) {
-        res.status(200).send({
-            announcements
-        })
-    } else {
+    if (announcements.length > 0) {} else {
         res.status(404).send({
             success:false,
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] EqualityOperator
Backend/controllers/anncController.js:48:9
     const announcements = await announcementModel.find({ receiverIDs: { $in: [emp.id] } }).sort({ createdAt: -1 }); 
     // console.log(announcements);
 
-    if (announcements.length > 0) {
+    if (announcements.length >= 0) {
         res.status(200).send({
             announcements
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/anncController.js:52:12
         res.status(200).send({
             announcements
         })
-    } else {
-        res.status(404).send({
-            success:false,
-            message:"Error In Announcement"
-        });
-    }
+    } else {}
 
 }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/anncController.js:53:30
             announcements
         })
     } else {
-        res.status(404).send({
-            success:false,
-            message:"Error In Announcement"
-        });
+        res.status(404).send({});
     }
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BooleanLiteral
Backend/controllers/anncController.js:54:21
         })
     } else {
         res.status(404).send({
-            success:false,
+            success:true,
             message:"Error In Announcement"
         });
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/anncController.js:55:21
     } else {
         res.status(404).send({
             success:false,
-            message:"Error In Announcement"
+            message:""
         });
     }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/anncController.js:62:38
 }
 
 //Last Id find for send the the employees
-async function handleLastIds(req,res){
-    // console.log("Enter")
-    const roles = ['admin', 'hr', 'manager', 'employee'];
-
-    const lastIds = {};
-    try {
-        for (const role of roles) {
-            const lastCounter = await stroeIdModel.findOne({ role }).sort({ createdAt: -1 }); 
-            lastIds[role] = lastCounter.cnt;
-        } 
-        res.status(200).send({
-            success: true,
-            lastIds
-        });
-    } catch (error) {
-        console.error("Error fetching last IDs", error);
-        res.status(500).send({
-            success: false,
-            message: "Error fetching last IDs",
-            error: error.message
-        });
-    }
-}
+async function handleLastIds(req,res){}
 
 //Sender View
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/anncController.js:64:20
 //Last Id find for send the the employees
 async function handleLastIds(req,res){
     // console.log("Enter")
-    const roles = ['admin', 'hr', 'manager', 'employee'];
+    const roles = ["", 'hr', 'manager', 'employee'];
 
     const lastIds = {};
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/anncController.js:64:35
 //Last Id find for send the the employees
 async function handleLastIds(req,res){
     // console.log("Enter")
-    const roles = ['admin', 'hr', 'manager', 'employee'];
+    const roles = ['admin', 'hr', "", 'employee'];
 
     const lastIds = {};
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/anncController.js:67:9
     const roles = ['admin', 'hr', 'manager', 'employee'];
 
     const lastIds = {};
-    try {
-        for (const role of roles) {
-            const lastCounter = await stroeIdModel.findOne({ role }).sort({ createdAt: -1 }); 
-            lastIds[role] = lastCounter.cnt;
-        } 
-        res.status(200).send({
-            success: true,
-            lastIds
-        });
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error fetching last IDs", error);
         res.status(500).send({
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/anncController.js:68:35
 
     const lastIds = {};
     try {
-        for (const role of roles) {
-            const lastCounter = await stroeIdModel.findOne({ role }).sort({ createdAt: -1 }); 
-            lastIds[role] = lastCounter.cnt;
-        } 
+        for (const role of roles) {} 
         res.status(200).send({
             success: true,
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] UnaryOperator
Backend/controllers/anncController.js:69:88
     const lastIds = {};
     try {
         for (const role of roles) {
-            const lastCounter = await stroeIdModel.findOne({ role }).sort({ createdAt: -1 }); 
+            const lastCounter = await stroeIdModel.findOne({ role }).sort({ createdAt: +1 }); 
             lastIds[role] = lastCounter.cnt;
         } 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Timeout] MethodExpression
Backend/controllers/anncController.js:69:39
     const lastIds = {};
     try {
         for (const role of roles) {
-            const lastCounter = await stroeIdModel.findOne({ role }).sort({ createdAt: -1 }); 
+            const lastCounter = await stroeIdModel.findOne({
+  role
+}); 
             lastIds[role] = lastCounter.cnt;
         } 

[Killed] BooleanLiteral
Backend/controllers/anncController.js:73:22
             lastIds[role] = lastCounter.cnt;
         } 
         res.status(200).send({
-            success: true,
+            success: false,
             lastIds
         });
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/anncController.js:76:21
             success: true,
             lastIds
         });
-    } catch (error) {
-        console.error("Error fetching last IDs", error);
-        res.status(500).send({
-            success: false,
-            message: "Error fetching last IDs",
-            error: error.message
-        });
-    }
+    } catch (error) {}
 }
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BooleanLiteral
Backend/controllers/anncController.js:79:22
     } catch (error) {
         console.error("Error fetching last IDs", error);
         res.status(500).send({
-            success: false,
+            success: true,
             message: "Error fetching last IDs",
             error: error.message
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/anncController.js:89:17
 //Sender View
 async function handleSendDetailsView(req,res){
     const token = req.cookies.jwt;
-    if (!token) {
-        return res.status(401).send({
-            success: false,
-            message: 'Authorization denied.',
-        });
-    }
+    if (!token) {}
  
     const verifyemp = jwt.verify(token, process.env.SECRET_KEY);
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] MethodExpression
Backend/controllers/anncController.js:99:33
     const verifyemp = jwt.verify(token, process.env.SECRET_KEY);
     const emp = await employeeModel.findById(verifyemp._id); 
     // console.log(emp.id)
-    const announcements = await announcementModel.find({senderID:emp.id}).sort({ createdAt: -1 }); 
+    const announcements = await announcementModel.find({
+  senderID: emp.id
+}); 
     // console.log(announcements);
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] UnaryOperator
Backend/controllers/anncController.js:99:93
     const verifyemp = jwt.verify(token, process.env.SECRET_KEY);
     const emp = await employeeModel.findById(verifyemp._id); 
     // console.log(emp.id)
-    const announcements = await announcementModel.find({senderID:emp.id}).sort({ createdAt: -1 }); 
+    const announcements = await announcementModel.find({senderID:emp.id}).sort({ createdAt: +1 }); 
     // console.log(announcements);
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] EqualityOperator
Backend/controllers/anncController.js:102:9
     const announcements = await announcementModel.find({senderID:emp.id}).sort({ createdAt: -1 }); 
     // console.log(announcements);
 
-    if (announcements.length > 0) {
+    if (announcements.length <= 0) {
         res.status(200).send({
             announcements
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/anncController.js:102:9
     const announcements = await announcementModel.find({senderID:emp.id}).sort({ createdAt: -1 }); 
     // console.log(announcements);
 
-    if (announcements.length > 0) {
+    if (true) {
         res.status(200).send({
             announcements
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.
