[Killed] BlockStatement
Backend/controllers/attendanceController.js:18:9
 
 //Atendance Mark save in Database
 async function markAttendance(emp_id, date) {
-    try {
-        const attendanceRecord = {
-            date: date,
-            status: "present",
-        };
-
-        let employee = await attendanceModel.findOne({ id: emp_id });
-        
-        console.log("Employee",employee);
-        if (employee) {
-            const updatedAttendance = await attendanceModel.updateOne(
-                { id: emp_id },
-                { $push: { attendance: attendanceRecord } }
-            );
-        } else {
-            const newEmployee = new attendanceModel({
-                id: emp_id,
-                attendance: [attendanceRecord],
-            });
-            await newEmployee.save();
-        }
-    
-        return true;
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error in markAttendance:", error);
         throw error;
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/attendanceController.js:27:13
         let employee = await attendanceModel.findOne({ id: emp_id });
         
         console.log("Employee",employee);
-        if (employee) {
+        if (true) {
             const updatedAttendance = await attendanceModel.updateOne(
                 { id: emp_id },
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/attendanceController.js:27:13
         let employee = await attendanceModel.findOne({ id: emp_id });
         
         console.log("Employee",employee);
-        if (employee) {
+        if (false) {
             const updatedAttendance = await attendanceModel.updateOne(
                 { id: emp_id },
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/attendanceController.js:32:16
                 { id: emp_id },
                 { $push: { attendance: attendanceRecord } }
             );
-        } else {
-            const newEmployee = new attendanceModel({
-                id: emp_id,
-                attendance: [attendanceRecord],
-            });
-            await newEmployee.save();
-        }
+        } else {}
     
         return true;
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/attendanceController.js:41:21
         }
     
         return true;
-    } catch (error) {
-        console.error("Error in markAttendance:", error);
-        throw error;
-    }
+    } catch (error) {}
 
 }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/attendanceController.js:50:9
 
 //Check for user mark attendace or not
 async function alreadyMarked(emp_id, date) {
-    try {
-
-        console.log("data",date);
-        const emp = await attendanceModel.findOne(
-            {
-                id: emp_id,
-                attendance: {
-                    $elemMatch: {
-                        date: date,
-                    },
-                },
-            },
-            {
-                "attendance.$": 1,
-            }
-        );
-
-        if (emp && emp.attendance && emp.attendance.length > 0) {
-            const status = emp.attendance[0].status;
-            return status == "present";
-        } else {
-            return false;
-        }
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error in alreadyMarked:", error);
         throw error;
killedBy: Announcement API Tests [Employee] should view announcements addressed to them
statusReason: Auth token is missing.

[Killed] StringLiteral
Backend/controllers/attendanceController.js:52:21
 async function alreadyMarked(emp_id, date) {
     try {
 
-        console.log("data",date);
+        console.log("",date);
         const emp = await attendanceModel.findOne(
             {
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/attendanceController.js:56:29
         const emp = await attendanceModel.findOne(
             {
                 id: emp_id,
-                attendance: {
-                    $elemMatch: {
-                        date: date,
-                    },
-                },
+                attendance: {},
             },
             {
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] EqualityOperator
Backend/controllers/attendanceController.js:67:38
             }
         );
 
-        if (emp && emp.attendance && emp.attendance.length > 0) {
+        if (emp && emp.attendance && emp.attendance.length <= 0) {
             const status = emp.attendance[0].status;
             return status == "present";
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] LogicalOperator
Backend/controllers/attendanceController.js:67:13
             }
         );
 
-        if (emp && emp.attendance && emp.attendance.length > 0) {
+        if (emp && emp.attendance || emp.attendance.length > 0) {
             const status = emp.attendance[0].status;
             return status == "present";
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/attendanceController.js:69:20
 
         if (emp && emp.attendance && emp.attendance.length > 0) {
             const status = emp.attendance[0].status;
-            return status == "present";
+            return false;
         } else {
             return false;
killedBy: Announcement API Tests [Admin] should fail to post an announcement with missing message
statusReason: Auth token is missing.

[Killed] ConditionalExpression
Backend/controllers/attendanceController.js:69:20
 
         if (emp && emp.attendance && emp.attendance.length > 0) {
             const status = emp.attendance[0].status;
-            return status == "present";
+            return true;
         } else {
             return false;
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/attendanceController.js:70:16
         if (emp && emp.attendance && emp.attendance.length > 0) {
             const status = emp.attendance[0].status;
             return status == "present";
-        } else {
-            return false;
-        }
+        } else {}
     } catch (error) {
         console.error("Error in alreadyMarked:", error);
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/attendanceController.js:73:21
         } else {
             return false;
         }
-    } catch (error) {
-        console.error("Error in alreadyMarked:", error);
-        throw error;
-    }
+    } catch (error) {}
 }
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/attendanceController.js:74:23
             return false;
         }
     } catch (error) {
-        console.error("Error in alreadyMarked:", error);
+        console.error("", error);
         throw error;
     }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/attendanceController.js:84:13
     try {
         const { id } = req.body;
 
-        if (!id) {
+        if (false) {
             return res.status(400).send({ status:false , message: "Employee ID is required." });
         }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/attendanceController.js:84:13
     try {
         const { id } = req.body;
 
-        if (!id) {
+        if (true) {
             return res.status(400).send({ status:false , message: "Employee ID is required." });
         }
killedBy: Announcement API Tests [Employee] should view announcements addressed to them
statusReason: Auth token is missing.

[Killed] BooleanLiteral
Backend/controllers/attendanceController.js:85:50
         const { id } = req.body;
 
         if (!id) {
-            return res.status(400).send({ status:false , message: "Employee ID is required." });
+            return res.status(400).send({ status:true , message: "Employee ID is required." });
         }
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/attendanceController.js:85:67
         const { id } = req.body;
 
         if (!id) {
-            return res.status(400).send({ status:false , message: "Employee ID is required." });
+            return res.status(400).send({ status:false , message: "" });
         }
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BooleanLiteral
Backend/controllers/attendanceController.js:88:12
             return res.status(400).send({ status:false , message: "Employee ID is required." });
         }
 
-        if(! req.body.latitude || !req.body.longitude)
+        if(req.body.latitude || !req.body.longitude)
             return res.status(400).send({status:false , message:"Location required"});
         
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/attendanceController.js:88:12
             return res.status(400).send({ status:false , message: "Employee ID is required." });
         }
 
-        if(! req.body.latitude || !req.body.longitude)
+        if(true)
             return res.status(400).send({status:false , message:"Location required"});
         
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BooleanLiteral
Backend/controllers/attendanceController.js:89:49
         }
 
         if(! req.body.latitude || !req.body.longitude)
-            return res.status(400).send({status:false , message:"Location required"});
+            return res.status(400).send({status:true , message:"Location required"});
         
         const emp = await employeeModel.findOne({ id });
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/attendanceController.js:89:41
         }
 
         if(! req.body.latitude || !req.body.longitude)
-            return res.status(400).send({status:false , message:"Location required"});
+            return res.status(400).send({});
         
         const emp = await employeeModel.findOne({ id });
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/attendanceController.js:92:13
             return res.status(400).send({status:false , message:"Location required"});
         
         const emp = await employeeModel.findOne({ id });
-        if (!emp) {
+        if (false) {
             return res.status(404).send({ status:false, message: "Employee with this ID not found." });
         }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/attendanceController.js:92:19
             return res.status(400).send({status:false , message:"Location required"});
         
         const emp = await employeeModel.findOne({ id });
-        if (!emp) {
-            return res.status(404).send({ status:false, message: "Employee with this ID not found." });
-        }
+        if (!emp) {}
 
         const today = new Date();
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BooleanLiteral
Backend/controllers/attendanceController.js:93:50
         
         const emp = await employeeModel.findOne({ id });
         if (!emp) {
-            return res.status(404).send({ status:false, message: "Employee with this ID not found." });
+            return res.status(404).send({ status:true, message: "Employee with this ID not found." });
         }
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/attendanceController.js:100:23
         today.setHours(0, 0, 0, 0);
 
         const indiaDateString = new Intl.DateTimeFormat('en-IN', {
-            timeZone: 'Asia/Kolkata',
+            timeZone: "",
             year: 'numeric',
             month: '2-digit',
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/attendanceController.js:101:19
 
         const indiaDateString = new Intl.DateTimeFormat('en-IN', {
             timeZone: 'Asia/Kolkata',
-            year: 'numeric',
+            year: "",
             month: '2-digit',
             day: '2-digit',
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/attendanceController.js:102:20
         const indiaDateString = new Intl.DateTimeFormat('en-IN', {
             timeZone: 'Asia/Kolkata',
             year: 'numeric',
-            month: '2-digit',
+            month: "",
             day: '2-digit',
         }).format(today);
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/attendanceController.js:112:19
         // console.log("India Time:", indiaDate);
 
         marked = await alreadyMarked(emp.id,indiaDate);
-        if(marked){
-            return res.status(409).send({
-                status: false,
-                message: "Your attendance has already been marked.",
-            });
-        }
+        if(marked){}
 
         // console.log(`Employee ID: ${emp.id}`);
killedBy: Announcement API Tests [Employee] should view announcements addressed to them
statusReason: Auth token is missing.

[Killed] ConditionalExpression
Backend/controllers/attendanceController.js:112:12
         // console.log("India Time:", indiaDate);
 
         marked = await alreadyMarked(emp.id,indiaDate);
-        if(marked){
+        if(false){
             return res.status(409).send({
                 status: false,
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/attendanceController.js:113:41
 
         marked = await alreadyMarked(emp.id,indiaDate);
         if(marked){
-            return res.status(409).send({
-                status: false,
-                message: "Your attendance has already been marked.",
-            });
+            return res.status(409).send({});
         }
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BooleanLiteral
Backend/controllers/attendanceController.js:114:25
         marked = await alreadyMarked(emp.id,indiaDate);
         if(marked){
             return res.status(409).send({
-                status: false,
+                status: true,
                 message: "Your attendance has already been marked.",
             });
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/attendanceController.js:121:34
 
         // console.log(`Employee ID: ${emp.id}`);
 
-        const employeeLocation = { latitude: req.body.latitude , longitude: req.body.longitude };
+        const employeeLocation = {};
         // console.log(employeeLocation);
         // console.log(companyLocation);
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] EqualityOperator
Backend/controllers/attendanceController.js:129:13
         distance = haversine(companyLocation, employeeLocation);
 
         // console.log("dist: ",distance);
-        if (distance > companyRadius) {
+        if (distance <= companyRadius) {
             return res.status(403).send({
                 status:false,
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/attendanceController.js:129:13
         distance = haversine(companyLocation, employeeLocation);
 
         // console.log("dist: ",distance);
-        if (distance > companyRadius) {
+        if (true) {
             return res.status(403).send({
                 status:false,
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BooleanLiteral
Backend/controllers/attendanceController.js:131:24
         // console.log("dist: ",distance);
         if (distance > companyRadius) {
             return res.status(403).send({
-                status:false,
+                status:true,
                 error: "Employee is outside the company area.",
                 distance: `${Math.round(distance)} meters away.`,
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/attendanceController.js:139:12
 
         attendanceMarked = await markAttendance(emp.id,indiaDate);
         
-        if(attendanceMarked)
+        if(false)
         {
             return res.status(200).send({
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/attendanceController.js:139:12
 
         attendanceMarked = await markAttendance(emp.id,indiaDate);
         
-        if(attendanceMarked)
+        if(true)
         {
             return res.status(200).send({
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/attendanceController.js:140:9
         attendanceMarked = await markAttendance(emp.id,indiaDate);
         
         if(attendanceMarked)
-        {
-            return res.status(200).send({
-                status:true,
-                message: "Attendance marked successfully.",
-            });
-        }
+        {}
         else{
             return res.status(500).send({
killedBy: Announcement API Tests [Admin] should fail to post an announcement with missing message
statusReason: Auth token is missing.

[Killed] BooleanLiteral
Backend/controllers/attendanceController.js:142:24
         if(attendanceMarked)
         {
             return res.status(200).send({
-                status:true,
+                status:false,
                 message: "Attendance marked successfully.",
             });
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/attendanceController.js:146:13
                 message: "Attendance marked successfully.",
             });
         }
-        else{
-            return res.status(500).send({
-                status:false,
-                message: "server not able to mark attendance",
-            });
-        }
+        else{}
 
     } catch (error) {
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BooleanLiteral
Backend/controllers/attendanceController.js:148:24
         }
         else{
             return res.status(500).send({
-                status:false,
+                status:true,
                 message: "server not able to mark attendance",
             });
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/attendanceController.js:149:26
         else{
             return res.status(500).send({
                 status:false,
-                message: "server not able to mark attendance",
+                message: "",
             });
         }
killedBy: Announcement API Tests [Employee] should view announcements addressed to them
statusReason: Auth token is missing.

[Killed] BlockStatement
Backend/controllers/attendanceController.js:153:21
             });
         }
 
-    } catch (error) {
-        console.error("Error in handleMarkAttendance:", error);
-        return res.status(500).send({
-            status:false,
-            error: error.message,
-        });
-    }
+    } catch (error) {}
 }
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/attendanceController.js:163:52
 }
 
 //Employee Attendace fetch by ID
-async function handleGetEmployeeAttendance(req,res){
-    // console.log("Enter For Fetch Datas...")
-    const { id } = req.params;  
-
-    try { 
-        const employee = await attendanceModel.findOne({id});
-        // console.log("EMP",employee)
-        if (!employee) { 
-            return res.status(200).json({ success: true, attendance: [] });
-        }
-
-        res.status(200).json({ success: true, attendance: employee.attendance });
-    } catch (error) {
-        console.error("Error fetching attendance:", error);
-        res.status(500).json({ success: false, message: "Error fetching attendance" });
-    }
-}
+async function handleGetEmployeeAttendance(req,res){}
 
 //Employee Absent List [register Date to today]
killedBy: Announcement API Tests [Admin] should fail to post an announcement with missing message
statusReason: Auth token is missing.

[Killed] BlockStatement
Backend/controllers/attendanceController.js:167:9
     // console.log("Enter For Fetch Datas...")
     const { id } = req.params;  
 
-    try { 
-        const employee = await attendanceModel.findOne({id});
-        // console.log("EMP",employee)
-        if (!employee) { 
-            return res.status(200).json({ success: true, attendance: [] });
-        }
-
-        res.status(200).json({ success: true, attendance: employee.attendance });
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error fetching attendance:", error);
         res.status(500).json({ success: false, message: "Error fetching attendance" });
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/attendanceController.js:170:13
     try { 
         const employee = await attendanceModel.findOne({id});
         // console.log("EMP",employee)
-        if (!employee) { 
+        if (true) { 
             return res.status(200).json({ success: true, attendance: [] });
         }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/attendanceController.js:170:24
     try { 
         const employee = await attendanceModel.findOne({id});
         // console.log("EMP",employee)
-        if (!employee) { 
-            return res.status(200).json({ success: true, attendance: [] });
-        }
+        if (!employee) {}
 
         res.status(200).json({ success: true, attendance: employee.attendance });
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BooleanLiteral
Backend/controllers/attendanceController.js:171:52
         const employee = await attendanceModel.findOne({id});
         // console.log("EMP",employee)
         if (!employee) { 
-            return res.status(200).json({ success: true, attendance: [] });
+            return res.status(200).json({ success: false, attendance: [] });
         }
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BooleanLiteral
Backend/controllers/attendanceController.js:174:41
             return res.status(200).json({ success: true, attendance: [] });
         }
 
-        res.status(200).json({ success: true, attendance: employee.attendance });
+        res.status(200).json({ success: false, attendance: employee.attendance });
     } catch (error) {
         console.error("Error fetching attendance:", error);
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/attendanceController.js:174:30
             return res.status(200).json({ success: true, attendance: [] });
         }
 
-        res.status(200).json({ success: true, attendance: employee.attendance });
+        res.status(200).json({});
     } catch (error) {
         console.error("Error fetching attendance:", error);
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/attendanceController.js:175:21
         }
 
         res.status(200).json({ success: true, attendance: employee.attendance });
-    } catch (error) {
-        console.error("Error fetching attendance:", error);
-        res.status(500).json({ success: false, message: "Error fetching attendance" });
-    }
+    } catch (error) {}
 }
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BooleanLiteral
Backend/controllers/attendanceController.js:177:41
         res.status(200).json({ success: true, attendance: employee.attendance });
     } catch (error) {
         console.error("Error fetching attendance:", error);
-        res.status(500).json({ success: false, message: "Error fetching attendance" });
+        res.status(500).json({ success: true, message: "Error fetching attendance" });
     }
 }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/attendanceController.js:177:30
         res.status(200).json({ success: true, attendance: employee.attendance });
     } catch (error) {
         console.error("Error fetching attendance:", error);
-        res.status(500).json({ success: false, message: "Error fetching attendance" });
+        res.status(500).json({});
     }
 }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/attendanceController.js:188:9
     // console.log("LId IS: ",id)
 
     const employee = await employeeModel.findOne({ id });
-    if (!employee) {
+    if (false) {
         return res.status(404).send({
             status: false,
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.
