[Killed] BlockStatement
Backend/controllers/auth.js:8:29
 const bcrypt = require('bcryptjs');
 
 // Generate 8 digit password
-function generatePassword() {
-    const characters = 'ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789@#$_';
-    let password = '';
-    const length = 8;
-
-    for (let i = 0; i < length; i++) {
-      const randomIndex = Math.floor(Math.random() * characters.length);
-      password += characters[randomIndex];
-    }
-    return password;
-}
+function generatePassword() {}
 
 // Give next Id for assign to new user
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ArithmeticOperator
Backend/controllers/auth.js:14:38
     const length = 8;
 
     for (let i = 0; i < length; i++) {
-      const randomIndex = Math.floor(Math.random() * characters.length);
+      const randomIndex = Math.floor(Math.random() / characters.length);
       password += characters[randomIndex];
     }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] AssignmentOperator
Backend/controllers/auth.js:15:7
 
     for (let i = 0; i < length; i++) {
       const randomIndex = Math.floor(Math.random() * characters.length);
-      password += characters[randomIndex];
+      password -= characters[randomIndex];
     }
     return password;
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/auth.js:21:34
 }
 
 // Give next Id for assign to new user
-const getNextId = async(role) => { 
-    let id = "";
-    const curr = await Counter.findOne({ role });
-    id = curr.cnt;
-
-    var num = parseInt(id.slice(5, 10), 10);
-    num = num + 1;
-    num = num.toString(); 
-    var com = ""
-    var com = id.slice(0, 5) + num;
-  
-    curr.cnt = com;
-    await Counter.updateOne({ role }, { $set: curr }); 
-    return com; 
-}
+const getNextId = async(role) => {}
 
 // Create an email transport object
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/auth.js:23:40
 // Give next Id for assign to new user
 const getNextId = async(role) => { 
     let id = "";
-    const curr = await Counter.findOne({ role });
+    const curr = await Counter.findOne({});
     id = curr.cnt;
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] MethodExpression
Backend/controllers/auth.js:26:24
     const curr = await Counter.findOne({ role });
     id = curr.cnt;
 
-    var num = parseInt(id.slice(5, 10), 10);
+    var num = parseInt(id, 10);
     num = num + 1;
     num = num.toString(); 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ArithmeticOperator
Backend/controllers/auth.js:27:11
     id = curr.cnt;
 
     var num = parseInt(id.slice(5, 10), 10);
-    num = num + 1;
+    num = num - 1;
     num = num.toString(); 
     var com = ""
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/auth.js:29:15
     var num = parseInt(id.slice(5, 10), 10);
     num = num + 1;
     num = num.toString(); 
-    var com = ""
+    var com = "Stryker was here!"
     var com = id.slice(0, 5) + num;
   
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] MethodExpression
Backend/controllers/auth.js:30:15
     num = num + 1;
     num = num.toString(); 
     var com = ""
-    var com = id.slice(0, 5) + num;
+    var com = id + num;
   
     curr.cnt = com;
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ArithmeticOperator
Backend/controllers/auth.js:30:15
     num = num + 1;
     num = num.toString(); 
     var com = ""
-    var com = id.slice(0, 5) + num;
+    var com = id.slice(0, 5) - num;
   
     curr.cnt = com;
killedBy: Announcement API Tests [Admin] should fail to post an announcement with missing message
statusReason: Auth token is missing.

[Killed] ObjectLiteral
Backend/controllers/auth.js:33:39
     var com = id.slice(0, 5) + num;
   
     curr.cnt = com;
-    await Counter.updateOne({ role }, { $set: curr }); 
+    await Counter.updateOne({ role }, {}); 
     return com; 
 }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/auth.js:38:50
 }
 
 // Create an email transport object
-const adminSendeMail = sendEmail.createTransport({
-    service: 'gmail',
-    sequre: true,
-    port:465,
-    auth: {
-      user: 'mistryriddhi10@gmail.com',
-      pass: 'vcua vpyw ovin juhk'
-    }
-});
+const adminSendeMail = sendEmail.createTransport({});
 
 // Handle Registration process
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/auth.js:39:14
 
 // Create an email transport object
 const adminSendeMail = sendEmail.createTransport({
-    service: 'gmail',
+    service: "",
     sequre: true,
     port:465,
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BooleanLiteral
Backend/controllers/auth.js:40:13
 // Create an email transport object
 const adminSendeMail = sendEmail.createTransport({
     service: 'gmail',
-    sequre: true,
+    sequre: false,
     port:465,
     auth: {
killedBy: Announcement API Tests [Admin] should fail to post an announcement with missing message
statusReason: Auth token is missing.

[Killed] ObjectLiteral
Backend/controllers/auth.js:63:42
       pass = await bcrypt.hash(pass,5);
         
       // Create new employee with this given details
-      const employee = new employeeModel({ name, pass, mail, role, id}); 
+      const employee = new employeeModel({}); 
       console.log(employee.id);
 
killedBy: Announcement API Tests [Admin] should fail to post an announcement with missing message
statusReason: Auth token is missing.

[Killed] StringLiteral
Backend/controllers/auth.js:71:15
   
       // Send the email to the employee
       const mailSendToEmployee = {
-        from: "mistryriddhi1510@gmail.com",
+        from: "",
         to: mail,
         subject:"Employee Registration - Welcome to StaffGrid",
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/auth.js:74:15
         from: "mistryriddhi1510@gmail.com",
         to: mail,
         subject:"Employee Registration - Welcome to StaffGrid",
-        text: `Dear ${name},
-
-        We are pleased to inform you that your account has been successfully created on our Employee Management System. Below are your account details:
-
-        Role: ${role}
-        ${role} ID: ${id}
-
-        Your temporary password is: ${emailpass}
-
-        For security purposes, we strongly recommend changing your password after your first login. If you encounter any issues or need assistance, feel free to contact the support team.
-
-        Best regards,
-        Admin Team
-        StaffGrid\n`,
+        text: ``,
       }
   
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/auth.js:90:64
         StaffGrid\n`,
       }
   
-      adminSendeMail.sendMail(mailSendToEmployee,(error,info)=>{
-        if(error){
-          console.log("Sending Email Error",error);
-          return res.status(500).send(error);
-        }else{
-          console.log("Email is sent");
-        }
-      })
+      adminSendeMail.sendMail(mailSendToEmployee,(error,info)=>{})
   
     } catch (error) {
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/auth.js:91:18
       }
   
       adminSendeMail.sendMail(mailSendToEmployee,(error,info)=>{
-        if(error){
-          console.log("Sending Email Error",error);
-          return res.status(500).send(error);
-        }else{
+        if(error){}else{
           console.log("Email is sent");
         }
killedBy: Announcement API Tests [Admin] should fail to post an announcement with missing message
statusReason: Auth token is missing.

[Killed] ConditionalExpression
Backend/controllers/auth.js:91:12
       }
   
       adminSendeMail.sendMail(mailSendToEmployee,(error,info)=>{
-        if(error){
+        if(true){
           console.log("Sending Email Error",error);
           return res.status(500).send(error);
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/auth.js:92:23
   
       adminSendeMail.sendMail(mailSendToEmployee,(error,info)=>{
         if(error){
-          console.log("Sending Email Error",error);
+          console.log("",error);
           return res.status(500).send(error);
         }else{
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/auth.js:94:14
         if(error){
           console.log("Sending Email Error",error);
           return res.status(500).send(error);
-        }else{
-          console.log("Email is sent");
-        }
+        }else{}
       })
   
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/auth.js:99:21
         }
       })
   
-    } catch (error) {
-      console.error("Error in registration:", error);
-      res.status(400).send({ error: error.message });  
-    }
+    } catch (error) {}
 };
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/auth.js:100:21
       })
   
     } catch (error) {
-      console.error("Error in registration:", error);
+      console.error("", error);
       res.status(400).send({ error: error.message });  
     }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/auth.js:109:49
 async function  handleUserLogin(req,res){
 
     try{
-        const emp = await employeeModel.findOne({id:req.body.id});
+        const emp = await employeeModel.findOne({});
         console.log(emp)
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/auth.js:112:27
         const emp = await employeeModel.findOne({id:req.body.id});
         console.log(emp)
 
-        if(emp==undefined){
-            return res.status(404).send({
-                success:false,
-                message:`ID is not valid`
-            });
-        }
+        if(emp==undefined){}
 
         //first decode the password and compare with original pass 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/auth.js:112:12
         const emp = await employeeModel.findOne({id:req.body.id});
         console.log(emp)
 
-        if(emp==undefined){
+        if(false){
             return res.status(404).send({
                 success:false,
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BooleanLiteral
Backend/controllers/auth.js:114:25
 
         if(emp==undefined){
             return res.status(404).send({
-                success:false,
+                success:true,
                 message:`ID is not valid`
             });
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/auth.js:115:25
         if(emp==undefined){
             return res.status(404).send({
                 success:false,
-                message:`ID is not valid`
+                message:``
             });
         }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/auth.js:122:21
         //first decode the password and compare with original pass 
         console.log(req.body.pass,emp.pass)        
         const statusoflogin = await bcrypt.compare(req.body.pass,emp.pass)
-        console.log("SOLOGIN: ",statusoflogin)
+        console.log("",statusoflogin)
         if(!statusoflogin){
             return res.status(500).send({
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BooleanLiteral
Backend/controllers/auth.js:123:12
         console.log(req.body.pass,emp.pass)        
         const statusoflogin = await bcrypt.compare(req.body.pass,emp.pass)
         console.log("SOLOGIN: ",statusoflogin)
-        if(!statusoflogin){
+        if(statusoflogin){
             return res.status(500).send({
                         success:false,
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/auth.js:123:12
         console.log(req.body.pass,emp.pass)        
         const statusoflogin = await bcrypt.compare(req.body.pass,emp.pass)
         console.log("SOLOGIN: ",statusoflogin)
-        if(!statusoflogin){
+        if(false){
             return res.status(500).send({
                         success:false,
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BooleanLiteral
Backend/controllers/auth.js:125:33
         console.log("SOLOGIN: ",statusoflogin)
         if(!statusoflogin){
             return res.status(500).send({
-                        success:false,
+                        success:true,
                         message:'Invalid Password'   
                     });
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ArithmeticOperator
Backend/controllers/auth.js:135:44
         console.log('TOKEN: ',token)
 
         res.cookie("jwt",token,{
-            expires: new Date(Date.now() + 24 * 60 * 60 * 1000),
+            expires: new Date(Date.now() + 24 * 60 / 60 * 1000),
             httpOnly:true,
             secure: true, // Required for HTTPS
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ArithmeticOperator
Backend/controllers/auth.js:135:44
         console.log('TOKEN: ',token)
 
         res.cookie("jwt",token,{
-            expires: new Date(Date.now() + 24 * 60 * 60 * 1000),
+            expires: new Date(Date.now() + 24 / 60 * 60 * 1000),
             httpOnly:true,
             secure: true, // Required for HTTPS
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BooleanLiteral
Backend/controllers/auth.js:136:22
 
         res.cookie("jwt",token,{
             expires: new Date(Date.now() + 24 * 60 * 60 * 1000),
-            httpOnly:true,
+            httpOnly:false,
             secure: true, // Required for HTTPS
             sameSite: 'None', // Required for cross-origin requests
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BooleanLiteral
Backend/controllers/auth.js:137:21
         res.cookie("jwt",token,{
             expires: new Date(Date.now() + 24 * 60 * 60 * 1000),
             httpOnly:true,
-            secure: true, // Required for HTTPS
+            secure: false, // Required for HTTPS
             sameSite: 'None', // Required for cross-origin requests
         })
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/auth.js:138:23
             expires: new Date(Date.now() + 24 * 60 * 60 * 1000),
             httpOnly:true,
             secure: true, // Required for HTTPS
-            sameSite: 'None', // Required for cross-origin requests
+            sameSite: "", // Required for cross-origin requests
         })
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BooleanLiteral
Backend/controllers/auth.js:142:21
         })
 
         return res.status(200).send({
-            success:true,
+            success:false,
             message:'Login SuccessFully',
             token,
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/auth.js:148:18
             emp
         });
 
-    }catch(error){
-        console.log(error);
-        res.status(500).send({
-            success:false,
-            message:'Login Error',
-            error
-        });
-    }
+    }catch(error){}
 };
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/auth.js:150:30
 
     }catch(error){
         console.log(error);
-        res.status(500).send({
-            success:false,
-            message:'Login Error',
-            error
-        });
+        res.status(500).send({});
     }
 };
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/auth.js:165:49
 
     try{
         // first get user from the data base
-        const emp = await employeeModel.findOne({id:req.body.id}); 
+        const emp = await employeeModel.findOne({}); 
     
         if(emp==undefined){
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/auth.js:167:12
         // first get user from the data base
         const emp = await employeeModel.findOne({id:req.body.id}); 
     
-        if(emp==undefined){
+        if(true){
             return res.status(404).send({
                 success:false,
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/auth.js:167:27
         // first get user from the data base
         const emp = await employeeModel.findOne({id:req.body.id}); 
     
-        if(emp==undefined){
-            return res.status(404).send({
-                success:false,
-                message:'ID is not valid'
-            })
-        }
+        if(emp==undefined){}
 
         const currpassword = req.body.currpassword;
killedBy: Announcement API Tests [Admin] should fail to post an announcement with missing message
statusReason: Auth token is missing.

[Killed] ConditionalExpression
Backend/controllers/auth.js:186:12
 
         // console.log(statusofchange,currpassword)
 
-        if(!statusofchange){
+        if(true){
             return res.status(500).send({
                         success:false,
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/auth.js:186:28
 
         // console.log(statusofchange,currpassword)
 
-        if(!statusofchange){
-            return res.status(500).send({
-                        success:false,
-                        message:'Invalid Password'   
-                    });
-        }
+        if(!statusofchange){}
          
 
killedBy: Announcement API Tests [Employee] should view announcements addressed to them
statusReason: Auth token is missing.

[Killed] ObjectLiteral
Backend/controllers/auth.js:187:41
         // console.log(statusofchange,currpassword)
 
         if(!statusofchange){
-            return res.status(500).send({
-                        success:false,
-                        message:'Invalid Password'   
-                    });
+            return res.status(500).send({});
         }
          
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ArithmeticOperator
Backend/controllers/auth.js:198:29
         const token =  await emp.generateAuthToken();  
     
         res.cookie("jwt",token,{
-          expires: new Date(Date.now() + 24 * 60 * 60 * 1000),
+          expires: new Date(Date.now() - 24 * 60 * 60 * 1000),
           httpOnly:true,
           secure: true, // Required for HTTPS
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/auth.js:214:18
             emp
         });
     
-    }catch(error){
-        console.log(error);
-        res.status(500).send({
-            success:false,
-            message:'Error in password change',
-            error
-        });
-    }
+    }catch(error){}
 };
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/auth.js:216:30
     
     }catch(error){
         console.log(error);
-        res.status(500).send({
-            success:false,
-            message:'Error in password change',
-            error
-        });
+        res.status(500).send({});
     }
 };
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/auth.js:218:21
         console.log(error);
         res.status(500).send({
             success:false,
-            message:'Error in password change',
+            message:"",
             error
         });
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] EqualityOperator
Backend/controllers/auth.js:232:12
         const emp = await employeeModel.findOne({id:req.body.id});
         const mail = emp.mail; 
     
-        if(emp==undefined){
+        if(emp != undefined){
             return res.status(404).send({
                 success:false,
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/auth.js:258:16
           await emp.save();
 
         adminSendeMail.sendMail(mailSendToEmployee,(error,info)=>{
-            if(error){
+            if(false){
               console.log("Sending Email Error",error);
               return res.status(500).send(error);
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/auth.js:266:18
             }
           }) 
 
-    }catch(error){
-        console.log(error);
-        res.status(500).send({
-            success:false,
-            message:'Email is not sent Password ERROR',
-            error
-        });
-    }
+    }catch(error){}
 };
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/auth.js:278:41
 
  
 // handle User Logout Process 
-async function handleUserLogout(req,res){
-    try {
-        req.employee.tokens = [];
-        //console.log(req.employee);
-        await req.employee.save();  
-        res.clearCookie("jwt");
-        res.send({ message: "Logged out successfully" });
-
-    } catch (error) {
-        res.status(500).send({ error: error.message });
-    }
-};
+async function handleUserLogout(req,res){};
 
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Timeout] BlockStatement
Backend/controllers/auth.js:279:9
  
 // handle User Logout Process 
 async function handleUserLogout(req,res){
-    try {
-        req.employee.tokens = [];
-        //console.log(req.employee);
-        await req.employee.save();  
-        res.clearCookie("jwt");
-        res.send({ message: "Logged out successfully" });
-
-    } catch (error) {
+    try {} catch (error) {
         res.status(500).send({ error: error.message });
     }

[Killed] ArrayDeclaration
Backend/controllers/auth.js:280:31
 // handle User Logout Process 
 async function handleUserLogout(req,res){
     try {
-        req.employee.tokens = [];
+        req.employee.tokens = ["Stryker was here"];
         //console.log(req.employee);
         await req.employee.save();  
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.
