[Killed] BooleanLiteral
Backend/controllers/attendanceController.js:190:21
     const employee = await employeeModel.findOne({ id });
     if (!employee) {
         return res.status(404).send({
-            status: false,
+            status: true,
             message: "Employee with this ID not found."
         });
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ArithmeticOperator
Backend/controllers/attendanceController.js:198:59
     const attendanceRecord = await attendanceModel.findOne({ id });
     const joiningDate = new Date(employee.createdAt);
     const today = new Date();
-    const totalDays = Math.floor((today - joiningDate) / (1000 * 60 * 60 * 24));
+    const totalDays = Math.floor((today - joiningDate) / (1000 * 60 * 60 / 24));
 
     // console.log("Total Days",totalDays)
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ArithmeticOperator
Backend/controllers/attendanceController.js:198:35
     const attendanceRecord = await attendanceModel.findOne({ id });
     const joiningDate = new Date(employee.createdAt);
     const today = new Date();
-    const totalDays = Math.floor((today - joiningDate) / (1000 * 60 * 60 * 24));
+    const totalDays = Math.floor((today + joiningDate) / (1000 * 60 * 60 * 24));
 
     // console.log("Total Days",totalDays)
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ArrayDeclaration
Backend/controllers/attendanceController.js:202:24
 
     // console.log("Total Days",totalDays)
 
-    const absentDays = [];   
+    const absentDays = ["Stryker was here"];   
     for (let i = 0; i <= totalDays; i++) {
         const checkDate = new Date(joiningDate);
killedBy: Announcement API Tests [Admin] should fail to post an announcement with missing message
statusReason: Auth token is missing.

[Killed] EqualityOperator
Backend/controllers/attendanceController.js:203:21
     // console.log("Total Days",totalDays)
 
     const absentDays = [];   
-    for (let i = 0; i <= totalDays; i++) {
+    for (let i = 0; i < totalDays; i++) {
         const checkDate = new Date(joiningDate);
         checkDate.setDate(checkDate.getDate() + i);
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] EqualityOperator
Backend/controllers/attendanceController.js:203:21
     // console.log("Total Days",totalDays)
 
     const absentDays = [];   
-    for (let i = 0; i <= totalDays; i++) {
+    for (let i = 0; i > totalDays; i++) {
         const checkDate = new Date(joiningDate);
         checkDate.setDate(checkDate.getDate() + i);
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] MethodExpression
Backend/controllers/attendanceController.js:205:9
     const absentDays = [];   
     for (let i = 0; i <= totalDays; i++) {
         const checkDate = new Date(joiningDate);
-        checkDate.setDate(checkDate.getDate() + i);
+        checkDate.setTime(checkDate.getDate() + i);
         const dateStr = checkDate.toISOString().slice(0, 10);  
         //console.log("ATD->",attendanceRecord)
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ArithmeticOperator
Backend/controllers/attendanceController.js:205:27
     const absentDays = [];   
     for (let i = 0; i <= totalDays; i++) {
         const checkDate = new Date(joiningDate);
-        checkDate.setDate(checkDate.getDate() + i);
+        checkDate.setDate(checkDate.getDate() - i);
         const dateStr = checkDate.toISOString().slice(0, 10);  
         //console.log("ATD->",attendanceRecord)
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] MethodExpression
Backend/controllers/attendanceController.js:206:25
     for (let i = 0; i <= totalDays; i++) {
         const checkDate = new Date(joiningDate);
         checkDate.setDate(checkDate.getDate() + i);
-        const dateStr = checkDate.toISOString().slice(0, 10);  
+        const dateStr = checkDate.toISOString();  
         //console.log("ATD->",attendanceRecord)
         const checkdays = attendanceRecord?.attendance.find(record => record.date === dateStr);
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] OptionalChaining
Backend/controllers/attendanceController.js:208:27
         checkDate.setDate(checkDate.getDate() + i);
         const dateStr = checkDate.toISOString().slice(0, 10);  
         //console.log("ATD->",attendanceRecord)
-        const checkdays = attendanceRecord?.attendance.find(record => record.date === dateStr);
+        const checkdays = attendanceRecord.attendance.find(record => record.date === dateStr);
         const status = checkdays ? checkdays.status : "absent";
         if (status === "absent") {
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/attendanceController.js:208:71
         checkDate.setDate(checkDate.getDate() + i);
         const dateStr = checkDate.toISOString().slice(0, 10);  
         //console.log("ATD->",attendanceRecord)
-        const checkdays = attendanceRecord?.attendance.find(record => record.date === dateStr);
+        const checkdays = attendanceRecord?.attendance.find(record => true);
         const status = checkdays ? checkdays.status : "absent";
         if (status === "absent") {
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/attendanceController.js:210:34
         //console.log("ATD->",attendanceRecord)
         const checkdays = attendanceRecord?.attendance.find(record => record.date === dateStr);
         const status = checkdays ? checkdays.status : "absent";
-        if (status === "absent") {
-            absentDays.push({
-                date: dateStr,
-                status: status
-            });
-        }
+        if (status === "absent") {}
     }
     // console.log("AbDASYS:---->", absentDays)
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/attendanceController.js:210:13
         //console.log("ATD->",attendanceRecord)
         const checkdays = attendanceRecord?.attendance.find(record => record.date === dateStr);
         const status = checkdays ? checkdays.status : "absent";
-        if (status === "absent") {
+        if (false) {
             absentDays.push({
                 date: dateStr,
killedBy: Announcement API Tests [Employee] should view announcements addressed to them
statusReason: Auth token is missing.

[Killed] ObjectLiteral
Backend/controllers/attendanceController.js:218:33
         }
     }
     // console.log("AbDASYS:---->", absentDays)
-    return res.status(200).json({
-        status: true, 
-        absentDays: absentDays
-    });
+    return res.status(200).json({});
 }
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BooleanLiteral
Backend/controllers/attendanceController.js:219:17
     }
     // console.log("AbDASYS:---->", absentDays)
     return res.status(200).json({
-        status: true, 
+        status: false, 
         absentDays: absentDays
     });
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ArithmeticOperator
Backend/controllers/attendanceController.js:234:56
         const currentYear = currentDate.getFullYear(); 
         const dayOfMonth = currentDate.getDate(); 
 
-        const totalDaysInMonth = new Date(currentYear, currentMonth + 1, 0).getDate(); 
+        const totalDaysInMonth = new Date(currentYear, currentMonth - 1, 0).getDate(); 
         
         const employees = await attendanceModel.find();
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/attendanceController.js:237:58
         const totalDaysInMonth = new Date(currentYear, currentMonth + 1, 0).getDate(); 
         
         const employees = await attendanceModel.find();
-        const attendanceData = employees.map(employee => {
-        const presentDaysThisMonth = employee.attendance.filter(record => {
-            const recordDate = new Date(record.date); 
-            return (
-              recordDate.getMonth() === currentMonth &&
-              recordDate.getFullYear() === currentYear &&
-                record.status === 'present'
-            );
-          }).length;        
-        const attendancePercentage = (presentDaysThisMonth / dayOfMonth) * 100; 
-        
-        return {
-          id: employee.id,
-          attendancePercentage: attendancePercentage.toFixed(2), 
-        };
-      });
+        const attendanceData = employees.map(employee => {});
       res.status(200).json({
         success: true,
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] MethodExpression
Backend/controllers/attendanceController.js:238:38
         
         const employees = await attendanceModel.find();
         const attendanceData = employees.map(employee => {
-        const presentDaysThisMonth = employee.attendance.filter(record => {
-            const recordDate = new Date(record.date); 
-            return (
-              recordDate.getMonth() === currentMonth &&
-              recordDate.getFullYear() === currentYear &&
-                record.status === 'present'
-            );
-          }).length;        
+        const presentDaysThisMonth = employee.attendance.length;        
         const attendancePercentage = (presentDaysThisMonth / dayOfMonth) * 100; 
         
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Timeout] BlockStatement
Backend/controllers/attendanceController.js:238:75
         
         const employees = await attendanceModel.find();
         const attendanceData = employees.map(employee => {
-        const presentDaysThisMonth = employee.attendance.filter(record => {
-            const recordDate = new Date(record.date); 
-            return (
-              recordDate.getMonth() === currentMonth &&
-              recordDate.getFullYear() === currentYear &&
-                record.status === 'present'
-            );
-          }).length;        
+        const presentDaysThisMonth = employee.attendance.filter(record => {}).length;        
         const attendancePercentage = (presentDaysThisMonth / dayOfMonth) * 100; 
         

[Killed] EqualityOperator
Backend/controllers/attendanceController.js:241:15
         const presentDaysThisMonth = employee.attendance.filter(record => {
             const recordDate = new Date(record.date); 
             return (
-              recordDate.getMonth() === currentMonth &&
+              recordDate.getMonth() !== currentMonth &&
               recordDate.getFullYear() === currentYear &&
                 record.status === 'present'
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/attendanceController.js:241:15
         const presentDaysThisMonth = employee.attendance.filter(record => {
             const recordDate = new Date(record.date); 
             return (
-              recordDate.getMonth() === currentMonth &&
-              recordDate.getFullYear() === currentYear &&
-                record.status === 'present'
+              true
             );
           }).length;        
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] EqualityOperator
Backend/controllers/attendanceController.js:242:15
             const recordDate = new Date(record.date); 
             return (
               recordDate.getMonth() === currentMonth &&
-              recordDate.getFullYear() === currentYear &&
+              recordDate.getFullYear() !== currentYear &&
                 record.status === 'present'
             );
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/attendanceController.js:242:15
             const recordDate = new Date(record.date); 
             return (
               recordDate.getMonth() === currentMonth &&
-              recordDate.getFullYear() === currentYear &&
+              true &&
                 record.status === 'present'
             );
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/attendanceController.js:243:17
             return (
               recordDate.getMonth() === currentMonth &&
               recordDate.getFullYear() === currentYear &&
-                record.status === 'present'
+                true
             );
           }).length;        
killedBy: Announcement API Tests [Employee] should view announcements addressed to them
statusReason: Auth token is missing.

[Killed] EqualityOperator
Backend/controllers/attendanceController.js:243:17
             return (
               recordDate.getMonth() === currentMonth &&
               recordDate.getFullYear() === currentYear &&
-                record.status === 'present'
+                record.status !== 'present'
             );
           }).length;        
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ArithmeticOperator
Backend/controllers/attendanceController.js:246:39
                 record.status === 'present'
             );
           }).length;        
-        const attendancePercentage = (presentDaysThisMonth / dayOfMonth) * 100; 
+        const attendancePercentage = (presentDaysThisMonth * dayOfMonth) * 100; 
         
         return {
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ArithmeticOperator
Backend/controllers/attendanceController.js:246:38
                 record.status === 'present'
             );
           }).length;        
-        const attendancePercentage = (presentDaysThisMonth / dayOfMonth) * 100; 
+        const attendancePercentage = presentDaysThisMonth / dayOfMonth / 100; 
         
         return {
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/attendanceController.js:255:18
       });
       res.status(200).json({
         success: true,
-        message: 'Attendance data fetched successfully',
+        message: "",
         data: attendanceData,
       });
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/attendanceController.js:259:21
         data: attendanceData,
       });
   
-    } catch (error) {
-      console.error('Error fetching employee details:', error);
-      res.status(500).json({
-        success: false,
-        message: 'Internal server error',
-        error: error.message,
-      });
-    }
+    } catch (error) {}
 
 }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/attendanceController.js:261:28
   
     } catch (error) {
       console.error('Error fetching employee details:', error);
-      res.status(500).json({
-        success: false,
-        message: 'Internal server error',
-        error: error.message,
-      });
+      res.status(500).json({});
     }
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/attendanceController.js:271:18
 }
 
  
-module.exports = {
-    handleMarkAttendance,
-    handleGetEmployeeAttendance,
-    handleGetAbsentList,
-    handleGetAllEmployeeDetails
-};
+module.exports = {};
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.
