[Killed] BlockStatement
Backend/controllers/leaveController.js:5:37
 const leaveModel = require('../model/leaveModel.js'); 
 
 //Leave Id geneerate for unique id
-const generateLeaveID = async () => {
-    const lastLeave = await leaveModel.findOne().sort({ appliedOn: -1 });
-    if (!lastLeave) return 'L1';
-    const lastID = lastLeave.leaveID;
-    const lastNumber = parseInt(lastID.substring(1), 10);
-    return `L${lastNumber + 1}`;
-};
+const generateLeaveID = async () => {};
 
 //Apply Leave by Employee/HR/Manager
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] MethodExpression
Backend/controllers/leaveController.js:6:29
 
 //Leave Id geneerate for unique id
 const generateLeaveID = async () => {
-    const lastLeave = await leaveModel.findOne().sort({ appliedOn: -1 });
+    const lastLeave = await leaveModel.findOne();
     if (!lastLeave) return 'L1';
     const lastID = lastLeave.leaveID;
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] UnaryOperator
Backend/controllers/leaveController.js:6:68
 
 //Leave Id geneerate for unique id
 const generateLeaveID = async () => {
-    const lastLeave = await leaveModel.findOne().sort({ appliedOn: -1 });
+    const lastLeave = await leaveModel.findOne().sort({ appliedOn: +1 });
     if (!lastLeave) return 'L1';
     const lastID = lastLeave.leaveID;
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/leaveController.js:7:9
 //Leave Id geneerate for unique id
 const generateLeaveID = async () => {
     const lastLeave = await leaveModel.findOne().sort({ appliedOn: -1 });
-    if (!lastLeave) return 'L1';
+    if (true) return 'L1';
     const lastID = lastLeave.leaveID;
     const lastNumber = parseInt(lastID.substring(1), 10);
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/leaveController.js:7:9
 //Leave Id geneerate for unique id
 const generateLeaveID = async () => {
     const lastLeave = await leaveModel.findOne().sort({ appliedOn: -1 });
-    if (!lastLeave) return 'L1';
+    if (false) return 'L1';
     const lastID = lastLeave.leaveID;
     const lastNumber = parseInt(lastID.substring(1), 10);
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] MethodExpression
Backend/controllers/leaveController.js:9:33
     const lastLeave = await leaveModel.findOne().sort({ appliedOn: -1 });
     if (!lastLeave) return 'L1';
     const lastID = lastLeave.leaveID;
-    const lastNumber = parseInt(lastID.substring(1), 10);
+    const lastNumber = parseInt(lastID, 10);
     return `L${lastNumber + 1}`;
 };
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ArithmeticOperator
Backend/controllers/leaveController.js:10:16
     if (!lastLeave) return 'L1';
     const lastID = lastLeave.leaveID;
     const lastNumber = parseInt(lastID.substring(1), 10);
-    return `L${lastNumber + 1}`;
+    return `L${lastNumber - 1}`;
 };
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/leaveController.js:10:12
     if (!lastLeave) return 'L1';
     const lastID = lastLeave.leaveID;
     const lastNumber = parseInt(lastID.substring(1), 10);
-    return `L${lastNumber + 1}`;
+    return ``;
 };
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/leaveController.js:20:13
 
         leaveID = await generateLeaveID();
 
-        if (leaveType === "Other Reason" && !otherReason) {
+        if (true) {
             return res.status(400).send({
                 status: false,
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/leaveController.js:20:13
 
         leaveID = await generateLeaveID();
 
-        if (leaveType === "Other Reason" && !otherReason) {
+        if (true && !otherReason) {
             return res.status(400).send({
                 status: false,
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BooleanLiteral
Backend/controllers/leaveController.js:22:25
 
         if (leaveType === "Other Reason" && !otherReason) {
             return res.status(400).send({
-                status: false,
+                status: true,
                 message: "Please provide additional details for 'Other' leave type."
             });
killedBy: Announcement API Tests [Employee] should view announcements addressed to them
statusReason: Auth token is missing.

[Killed] StringLiteral
Backend/controllers/leaveController.js:23:26
         if (leaveType === "Other Reason" && !otherReason) {
             return res.status(400).send({
                 status: false,
-                message: "Please provide additional details for 'Other' leave type."
+                message: ""
             });
         }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/leaveController.js:34:17
             fromDate,
             toDate,
             totalDays, 
-            ...(leaveType === "Other Reason" && { otherReason }), 
+            ...(true), 
             appliedOn: new Date()
         });
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/leaveController.js:34:17
             fromDate,
             toDate,
             totalDays, 
-            ...(leaveType === "Other Reason" && { otherReason }), 
+            ...(true && { otherReason }), 
             appliedOn: new Date()
         });
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BooleanLiteral
Backend/controllers/leaveController.js:39:38
         });
 
         const savedLeave = await newLeave.save();
-        res.status(201).send({status:true,message: 'Leave applied successfully'});
+        res.status(201).send({status:false,message: 'Leave applied successfully'});
     } catch (error) {
         res.status(500).send({ error: error.message });
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/leaveController.js:39:52
         });
 
         const savedLeave = await newLeave.save();
-        res.status(201).send({status:true,message: 'Leave applied successfully'});
+        res.status(201).send({status:true,message: ""});
     } catch (error) {
         res.status(500).send({ error: error.message });
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/leaveController.js:40:21
 
         const savedLeave = await newLeave.save();
         res.status(201).send({status:true,message: 'Leave applied successfully'});
-    } catch (error) {
-        res.status(500).send({ error: error.message });
-    }
+    } catch (error) {}
 }
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/leaveController.js:46:43
 }
 
 //Get All Leaves by Admin to view
-async function handleGetAllLeaves(req,res){
-    try { 
-        const receivedLeaves = await leaveModel.find().sort({ appliedOn: -1 });
-        res.status(200).send({status:true, receivedLeaves: receivedLeaves});
-
-    } catch (error) {
-        res.status(500).send({ error: error.message });
-    }
-}
+async function handleGetAllLeaves(req,res){}
 
 //Employee view Sent Leave List
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/leaveController.js:47:9
 
 //Get All Leaves by Admin to view
 async function handleGetAllLeaves(req,res){
-    try { 
-        const receivedLeaves = await leaveModel.find().sort({ appliedOn: -1 });
-        res.status(200).send({status:true, receivedLeaves: receivedLeaves});
-
-    } catch (error) {
+    try {} catch (error) {
         res.status(500).send({ error: error.message });
     }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] UnaryOperator
Backend/controllers/leaveController.js:48:74
 //Get All Leaves by Admin to view
 async function handleGetAllLeaves(req,res){
     try { 
-        const receivedLeaves = await leaveModel.find().sort({ appliedOn: -1 });
+        const receivedLeaves = await leaveModel.find().sort({ appliedOn: +1 });
         res.status(200).send({status:true, receivedLeaves: receivedLeaves});
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] MethodExpression
Backend/controllers/leaveController.js:48:38
 //Get All Leaves by Admin to view
 async function handleGetAllLeaves(req,res){
     try { 
-        const receivedLeaves = await leaveModel.find().sort({ appliedOn: -1 });
+        const receivedLeaves = await leaveModel.find();
         res.status(200).send({status:true, receivedLeaves: receivedLeaves});
 
killedBy: Announcement API Tests [Admin] should fail to post an announcement with missing message
statusReason: Auth token is missing.

[Killed] BooleanLiteral
Backend/controllers/leaveController.js:49:38
 async function handleGetAllLeaves(req,res){
     try { 
         const receivedLeaves = await leaveModel.find().sort({ appliedOn: -1 });
-        res.status(200).send({status:true, receivedLeaves: receivedLeaves});
+        res.status(200).send({status:false, receivedLeaves: receivedLeaves});
 
     } catch (error) {
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/leaveController.js:51:21
         const receivedLeaves = await leaveModel.find().sort({ appliedOn: -1 });
         res.status(200).send({status:true, receivedLeaves: receivedLeaves});
 
-    } catch (error) {
-        res.status(500).send({ error: error.message });
-    }
+    } catch (error) {}
 }
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/leaveController.js:57:44
 }
 
 //Employee view Sent Leave List
-async function handleGetSentLeaves(req,res){
-    try {
-        const { id: senderId } = req.params;
-        // console.log(senderId)
-        const sentLeaves = await leaveModel.find({ senderId }).sort({ appliedOn: -1 });
-        res.status(200).send({status:true, sentLeave: sentLeaves});
-
-    } catch (error) {
-        res.status(500).send({ error: error.message });
-    }
-}
+async function handleGetSentLeaves(req,res){}
 
 //Admin Update the status of leave
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/leaveController.js:58:9
 
 //Employee view Sent Leave List
 async function handleGetSentLeaves(req,res){
-    try {
-        const { id: senderId } = req.params;
-        // console.log(senderId)
-        const sentLeaves = await leaveModel.find({ senderId }).sort({ appliedOn: -1 });
-        res.status(200).send({status:true, sentLeave: sentLeaves});
-
-    } catch (error) {
+    try {} catch (error) {
         res.status(500).send({ error: error.message });
     }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] MethodExpression
Backend/controllers/leaveController.js:61:34
     try {
         const { id: senderId } = req.params;
         // console.log(senderId)
-        const sentLeaves = await leaveModel.find({ senderId }).sort({ appliedOn: -1 });
+        const sentLeaves = await leaveModel.find({
+  senderId
+});
         res.status(200).send({status:true, sentLeave: sentLeaves});
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] UnaryOperator
Backend/controllers/leaveController.js:61:82
     try {
         const { id: senderId } = req.params;
         // console.log(senderId)
-        const sentLeaves = await leaveModel.find({ senderId }).sort({ appliedOn: -1 });
+        const sentLeaves = await leaveModel.find({ senderId }).sort({ appliedOn: +1 });
         res.status(200).send({status:true, sentLeave: sentLeaves});
 
killedBy: Announcement API Tests [Employee] should view announcements addressed to them
statusReason: Auth token is missing.

[Killed] BooleanLiteral
Backend/controllers/leaveController.js:62:38
         const { id: senderId } = req.params;
         // console.log(senderId)
         const sentLeaves = await leaveModel.find({ senderId }).sort({ appliedOn: -1 });
-        res.status(200).send({status:true, sentLeave: sentLeaves});
+        res.status(200).send({status:false, sentLeave: sentLeaves});
 
     } catch (error) {
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/leaveController.js:72:9
 //Admin Update the status of leave
 async function handleUpdateLeave(req,res){
     // console.log("ENTER HERE....")
-    try {
-        const { leaveID } = req.params;
-        const leaveData = req.body;
-        // console.log(leaveID,leaveStatus,comment) 
-        // console.log(leaveData,leaveID)
-      const LeaveUpdate = await leaveModel.findOneAndUpdate(
-        { leaveID: leaveID },
-        leaveData,
-          { new: true }
-      );
-      
-      if (!LeaveUpdate) {
-          return res.status(404).json({ message: "Leave not found" });
-      }
-
-      return res.status(200).json({
-          message: "Leave updated successfully",
-          LeaveUpdate
-      });
-
-    } catch(error) {
+    try {} catch(error) {
       console.error("Error updating Leave:", error);
       return res.status(500).json({ message: "Server error" });
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BooleanLiteral
Backend/controllers/leaveController.js:80:18
       const LeaveUpdate = await leaveModel.findOneAndUpdate(
         { leaveID: leaveID },
         leaveData,
-          { new: true }
+          { new: false }
       );
       
killedBy: Announcement API Tests [Admin] should fail to post an announcement with missing message
statusReason: Auth token is missing.

[Killed] ObjectLiteral
Backend/controllers/leaveController.js:80:11
       const LeaveUpdate = await leaveModel.findOneAndUpdate(
         { leaveID: leaveID },
         leaveData,
-          { new: true }
+          {}
       );
       
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/leaveController.js:83:25
           { new: true }
       );
       
-      if (!LeaveUpdate) {
-          return res.status(404).json({ message: "Leave not found" });
-      }
+      if (!LeaveUpdate) {}
 
       return res.status(200).json({
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/leaveController.js:83:11
           { new: true }
       );
       
-      if (!LeaveUpdate) {
+      if (true) {
           return res.status(404).json({ message: "Leave not found" });
       }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/leaveController.js:84:39
       );
       
       if (!LeaveUpdate) {
-          return res.status(404).json({ message: "Leave not found" });
+          return res.status(404).json({});
       }
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/leaveController.js:87:35
           return res.status(404).json({ message: "Leave not found" });
       }
 
-      return res.status(200).json({
-          message: "Leave updated successfully",
-          LeaveUpdate
-      });
+      return res.status(200).json({});
 
     } catch(error) {
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/leaveController.js:92:20
           LeaveUpdate
       });
 
-    } catch(error) {
-      console.error("Error updating Leave:", error);
-      return res.status(500).json({ message: "Server error" });
-    }
+    } catch(error) {}
     
        
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/leaveController.js:94:46
 
     } catch(error) {
       console.error("Error updating Leave:", error);
-      return res.status(500).json({ message: "Server error" });
+      return res.status(500).json({ message: "" });
     }
     
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/leaveController.js:101:42
 }
 
 //Delete Leave by Employee/Hr/Manager
-async function handleDeleteLeave(req,res){
-    console.log("Enter Here...")
-    try {
-        const { leaveID } = req.params;
-        // console.log(leaveID)
-        if (!leaveID) {
-            return res.status(400).send({ error: "Leave ID is required." });
-        }
-        const deletedLeave = await leaveModel.findOneAndDelete({ leaveID:leaveID });
-        if (!deletedLeave) {
-            return res.status(404).send({ error: "Leave record not found." });
-        }
-        res.status(200).send({ message: "Leave record deleted successfully.", deletedLeave });
-
-
-    } catch (error) {
-        res.status(500).send({ error: error.message });
-    }
-}
+async function handleDeleteLeave(req,res){}
 
 //List of Approved
killedBy: Announcement API Tests [Admin] should fail to post an announcement with missing message
statusReason: Auth token is missing.

[Killed] StringLiteral
Backend/controllers/leaveController.js:102:17
 
 //Delete Leave by Employee/Hr/Manager
 async function handleDeleteLeave(req,res){
-    console.log("Enter Here...")
+    console.log("")
     try {
         const { leaveID } = req.params;
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/leaveController.js:103:9
 //Delete Leave by Employee/Hr/Manager
 async function handleDeleteLeave(req,res){
     console.log("Enter Here...")
-    try {
-        const { leaveID } = req.params;
-        // console.log(leaveID)
-        if (!leaveID) {
-            return res.status(400).send({ error: "Leave ID is required." });
-        }
-        const deletedLeave = await leaveModel.findOneAndDelete({ leaveID:leaveID });
-        if (!deletedLeave) {
-            return res.status(404).send({ error: "Leave record not found." });
-        }
-        res.status(200).send({ message: "Leave record deleted successfully.", deletedLeave });
-
-
-    } catch (error) {
+    try {} catch (error) {
         res.status(500).send({ error: error.message });
     }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/leaveController.js:106:13
     try {
         const { leaveID } = req.params;
         // console.log(leaveID)
-        if (!leaveID) {
+        if (true) {
             return res.status(400).send({ error: "Leave ID is required." });
         }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/leaveController.js:106:23
     try {
         const { leaveID } = req.params;
         // console.log(leaveID)
-        if (!leaveID) {
-            return res.status(400).send({ error: "Leave ID is required." });
-        }
+        if (!leaveID) {}
         const deletedLeave = await leaveModel.findOneAndDelete({ leaveID:leaveID });
         if (!deletedLeave) {
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/leaveController.js:107:41
         const { leaveID } = req.params;
         // console.log(leaveID)
         if (!leaveID) {
-            return res.status(400).send({ error: "Leave ID is required." });
+            return res.status(400).send({});
         }
         const deletedLeave = await leaveModel.findOneAndDelete({ leaveID:leaveID });
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/leaveController.js:107:50
         const { leaveID } = req.params;
         // console.log(leaveID)
         if (!leaveID) {
-            return res.status(400).send({ error: "Leave ID is required." });
+            return res.status(400).send({ error: "" });
         }
         const deletedLeave = await leaveModel.findOneAndDelete({ leaveID:leaveID });
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/leaveController.js:110:28
             return res.status(400).send({ error: "Leave ID is required." });
         }
         const deletedLeave = await leaveModel.findOneAndDelete({ leaveID:leaveID });
-        if (!deletedLeave) {
-            return res.status(404).send({ error: "Leave record not found." });
-        }
+        if (!deletedLeave) {}
         res.status(200).send({ message: "Leave record deleted successfully.", deletedLeave });
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/leaveController.js:110:13
             return res.status(400).send({ error: "Leave ID is required." });
         }
         const deletedLeave = await leaveModel.findOneAndDelete({ leaveID:leaveID });
-        if (!deletedLeave) {
+        if (false) {
             return res.status(404).send({ error: "Leave record not found." });
         }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/leaveController.js:111:50
         }
         const deletedLeave = await leaveModel.findOneAndDelete({ leaveID:leaveID });
         if (!deletedLeave) {
-            return res.status(404).send({ error: "Leave record not found." });
+            return res.status(404).send({ error: "" });
         }
         res.status(200).send({ message: "Leave record deleted successfully.", deletedLeave });
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/leaveController.js:122:47
 }
 
 //List of Approved
-async function handleApprovedListDate(req,res){
-    const { senderId } = req.params;
-    // console.log("Sender ID is here...",senderId)        
-    try {
-        const approvedLeaves = await leaveModel.find({
-            senderId: senderId,
-            leaveStatus: 'Approved'
-        });
-        // console.log("Lengthis:---> ",approvedLeaves.length)
-        if (approvedLeaves.length === 0) {
-            // console.log("Not Approved");
-        }
-        const leaveDates = approvedLeaves.map(leave => ({
-            fromDate: leave.fromDate,
-            toDate: leave.toDate
-        }));
-        return res.status(200).send({
-            status: true,
-            leaveDates: leaveDates
-        });
-    } catch (error) {
-        console.error("Error getting approved leave dates:", error);
-        return res.status(500).send({ message: "Server error" });
-    }
-}
+async function handleApprovedListDate(req,res){}
 
 module.exports = {
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/leaveController.js:125:9
 async function handleApprovedListDate(req,res){
     const { senderId } = req.params;
     // console.log("Sender ID is here...",senderId)        
-    try {
-        const approvedLeaves = await leaveModel.find({
-            senderId: senderId,
-            leaveStatus: 'Approved'
-        });
-        // console.log("Lengthis:---> ",approvedLeaves.length)
-        if (approvedLeaves.length === 0) {
-            // console.log("Not Approved");
-        }
-        const leaveDates = approvedLeaves.map(leave => ({
-            fromDate: leave.fromDate,
-            toDate: leave.toDate
-        }));
-        return res.status(200).send({
-            status: true,
-            leaveDates: leaveDates
-        });
-    } catch (error) {
+    try {} catch (error) {
         console.error("Error getting approved leave dates:", error);
         return res.status(500).send({ message: "Server error" });
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/leaveController.js:126:54
     const { senderId } = req.params;
     // console.log("Sender ID is here...",senderId)        
     try {
-        const approvedLeaves = await leaveModel.find({
-            senderId: senderId,
-            leaveStatus: 'Approved'
-        });
+        const approvedLeaves = await leaveModel.find({});
         // console.log("Lengthis:---> ",approvedLeaves.length)
         if (approvedLeaves.length === 0) {
killedBy: Announcement API Tests [Admin] should fail to post an announcement with missing message
statusReason: Auth token is missing.

[Killed] StringLiteral
Backend/controllers/leaveController.js:128:26
     try {
         const approvedLeaves = await leaveModel.find({
             senderId: senderId,
-            leaveStatus: 'Approved'
+            leaveStatus: ""
         });
         // console.log("Lengthis:---> ",approvedLeaves.length)
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/leaveController.js:131:13
             leaveStatus: 'Approved'
         });
         // console.log("Lengthis:---> ",approvedLeaves.length)
-        if (approvedLeaves.length === 0) {
+        if (false) {
             // console.log("Not Approved");
         }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] EqualityOperator
Backend/controllers/leaveController.js:131:13
             leaveStatus: 'Approved'
         });
         // console.log("Lengthis:---> ",approvedLeaves.length)
-        if (approvedLeaves.length === 0) {
+        if (approvedLeaves.length !== 0) {
             // console.log("Not Approved");
         }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.
