[Killed] ArrowFunction
Backend/controllers/leaveController.js:134:47
         if (approvedLeaves.length === 0) {
             // console.log("Not Approved");
         }
-        const leaveDates = approvedLeaves.map(leave => ({
-            fromDate: leave.fromDate,
-            toDate: leave.toDate
-        }));
+        const leaveDates = approvedLeaves.map(() => undefined);
         return res.status(200).send({
             status: true,
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/leaveController.js:138:37
             fromDate: leave.fromDate,
             toDate: leave.toDate
         }));
-        return res.status(200).send({
-            status: true,
-            leaveDates: leaveDates
-        });
+        return res.status(200).send({});
     } catch (error) {
         console.error("Error getting approved leave dates:", error);
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/leaveController.js:142:21
             status: true,
             leaveDates: leaveDates
         });
-    } catch (error) {
-        console.error("Error getting approved leave dates:", error);
-        return res.status(500).send({ message: "Server error" });
-    }
+    } catch (error) {}
 }
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/leaveController.js:144:37
         });
     } catch (error) {
         console.error("Error getting approved leave dates:", error);
-        return res.status(500).send({ message: "Server error" });
+        return res.status(500).send({});
     }
 }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.
