[Killed] StringLiteral
Backend/controllers/profileController.js:130:27
 
 
   try {
-    let profileImageUrl = "";   
+    let profileImageUrl = "Stryker was here!";   
  
     // console.log("HERE IS BACKEND FILE: ",req.file);
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/profileController.js:134:9
  
     // console.log("HERE IS BACKEND FILE: ",req.file);
     
-    if (req.file) { 
+    if (false) { 
       const result = await cloudinary.uploader.upload(req.file.path);
       profileImageUrl = result.url;   
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/profileController.js:134:9
  
     // console.log("HERE IS BACKEND FILE: ",req.file);
     
-    if (req.file) { 
+    if (true) { 
       const result = await cloudinary.uploader.upload(req.file.path);
       profileImageUrl = result.url;   
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/profileController.js:145:26
     await detailedprofile.save();
 
     // console.log("Save DONE:::><");
-    res.status(201).send({ detailedprofile });
+    res.status(201).send({});
   } catch (error) {
     console.error("Error in Detail Profile:", error);
killedBy: Announcement API Tests [Admin] should fail to post an announcement with missing message
statusReason: Auth token is missing.

[Killed] BlockStatement
Backend/controllers/profileController.js:146:19
 
     // console.log("Save DONE:::><");
     res.status(201).send({ detailedprofile });
-  } catch (error) {
-    console.error("Error in Detail Profile:", error);
-    res.status(400).send({ error: error.message });
-  }
+  } catch (error) {}
 }
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/profileController.js:153:46
 }
 
 //Check already fill or not
-async function handleUserProfileGet(req, res){
-
-  try {
-    const { id } = req.params;
-    // console.log(id)
-    const employee = await employeeModel.findOne({id}); 
-    // console.log(employee) 
-    res.status(200).send(employee);
-} catch (error) {
-    console.log("Error For find ID")
-    res.status(505).send("ERROR for find thee User")
-}
-};
+async function handleUserProfileGet(req, res){};
 
 //get detail profile 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/profileController.js:155:7
 //Check already fill or not
 async function handleUserProfileGet(req, res){
 
-  try {
-    const { id } = req.params;
-    // console.log(id)
-    const employee = await employeeModel.findOne({id}); 
-    // console.log(employee) 
-    res.status(200).send(employee);
-} catch (error) {
+  try {} catch (error) {
     console.log("Error For find ID")
     res.status(505).send("ERROR for find thee User")
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/profileController.js:158:50
   try {
     const { id } = req.params;
     // console.log(id)
-    const employee = await employeeModel.findOne({id}); 
+    const employee = await employeeModel.findOne({}); 
     // console.log(employee) 
     res.status(200).send(employee);
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/profileController.js:161:17
     const employee = await employeeModel.findOne({id}); 
     // console.log(employee) 
     res.status(200).send(employee);
-} catch (error) {
-    console.log("Error For find ID")
-    res.status(505).send("ERROR for find thee User")
-}
+} catch (error) {}
 };
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/profileController.js:168:54
 };
 
 //get detail profile 
-async function handleUserProfileGetDetailed(req, res){
-
-  try {
-    const { id } = req.params;
-    const detailemployee = await detailedProfile.findOne({id}); 
-    res.status(200).send(detailemployee);
-} catch (error) {
-    console.log("Error For find ID")
-    res.status(505).send("ERROR for find thee User")
-}
-};
+async function handleUserProfileGetDetailed(req, res){};
 
 //Check save or not In Profile In DP
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/profileController.js:170:7
 //get detail profile 
 async function handleUserProfileGetDetailed(req, res){
 
-  try {
-    const { id } = req.params;
-    const detailemployee = await detailedProfile.findOne({id}); 
-    res.status(200).send(detailemployee);
-} catch (error) {
+  try {} catch (error) {
     console.log("Error For find ID")
     res.status(505).send("ERROR for find thee User")
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/profileController.js:174:17
     const { id } = req.params;
     const detailemployee = await detailedProfile.findOne({id}); 
     res.status(200).send(detailemployee);
-} catch (error) {
-    console.log("Error For find ID")
-    res.status(505).send("ERROR for find thee User")
-}
+} catch (error) {}
 };
 
killedBy: Announcement API Tests [Admin] should fail to post an announcement with missing message
statusReason: Auth token is missing.

[Killed] BlockStatement
Backend/controllers/profileController.js:181:53
 };
 
 //Check save or not In Profile In DP
-async function handleUserProfileViewOrNot(req, res) {
-  try { 
-    const { id } = req.params;
-    // console.log(id)
-    const detailemployee = await detailedProfile.findOne({id}); 
-    // console.log(detailemployee)
-    if (detailemployee) {
-      return res.status(200).send({success: true,detailemployee}); 
-    } else {
-      return res.status(404).send(false); 
-    }
-  } catch (error) {
-    return res.status(500).send(false);  
-  }
-}
+async function handleUserProfileViewOrNot(req, res) {}
 
 module.exports = {
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/profileController.js:182:7
 
 //Check save or not In Profile In DP
 async function handleUserProfileViewOrNot(req, res) {
-  try { 
-    const { id } = req.params;
-    // console.log(id)
-    const detailemployee = await detailedProfile.findOne({id}); 
-    // console.log(detailemployee)
-    if (detailemployee) {
-      return res.status(200).send({success: true,detailemployee}); 
-    } else {
-      return res.status(404).send(false); 
-    }
-  } catch (error) {
+  try {} catch (error) {
     return res.status(500).send(false);  
   }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/profileController.js:185:58
   try { 
     const { id } = req.params;
     // console.log(id)
-    const detailemployee = await detailedProfile.findOne({id}); 
+    const detailemployee = await detailedProfile.findOne({}); 
     // console.log(detailemployee)
     if (detailemployee) {
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/profileController.js:187:9
     // console.log(id)
     const detailemployee = await detailedProfile.findOne({id}); 
     // console.log(detailemployee)
-    if (detailemployee) {
+    if (true) {
       return res.status(200).send({success: true,detailemployee}); 
     } else {
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/profileController.js:187:9
     // console.log(id)
     const detailemployee = await detailedProfile.findOne({id}); 
     // console.log(detailemployee)
-    if (detailemployee) {
+    if (false) {
       return res.status(200).send({success: true,detailemployee}); 
     } else {
killedBy: Announcement API Tests [Admin] should fail to post an announcement with missing message
statusReason: Auth token is missing.

[Killed] BooleanLiteral
Backend/controllers/profileController.js:188:45
     const detailemployee = await detailedProfile.findOne({id}); 
     // console.log(detailemployee)
     if (detailemployee) {
-      return res.status(200).send({success: true,detailemployee}); 
+      return res.status(200).send({success: false,detailemployee}); 
     } else {
       return res.status(404).send(false); 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/profileController.js:189:12
     // console.log(detailemployee)
     if (detailemployee) {
       return res.status(200).send({success: true,detailemployee}); 
-    } else {
-      return res.status(404).send(false); 
-    }
+    } else {}
   } catch (error) {
     return res.status(500).send(false);  
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BooleanLiteral
Backend/controllers/profileController.js:190:35
     if (detailemployee) {
       return res.status(200).send({success: true,detailemployee}); 
     } else {
-      return res.status(404).send(false); 
+      return res.status(404).send(true); 
     }
   } catch (error) {
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/profileController.js:192:19
     } else {
       return res.status(404).send(false); 
     }
-  } catch (error) {
-    return res.status(500).send(false);  
-  }
+  } catch (error) {}
 }
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BooleanLiteral
Backend/controllers/profileController.js:193:33
       return res.status(404).send(false); 
     }
   } catch (error) {
-    return res.status(500).send(false);  
+    return res.status(500).send(true);  
   }
 }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.
