[Killed] BlockStatement
Backend/controllers/projectController.js:4:39
 const projectModel = require('../model/projectModel');
 
 //for unique project id
-const generateProjectID = async () => {
-    const lastProject = await projectModel.findOne().sort({ createdAt: -1 });
-    if (!lastProject) return 'p1';
-    const lastID = lastProject.projectId;  
-    const lastNumber = parseInt(lastID.substring(1), 10); 
-    return `p${lastNumber+1}`;
-};
+const generateProjectID = async () => {};
 
 // Upload new project Details
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] MethodExpression
Backend/controllers/projectController.js:5:31
 
 //for unique project id
 const generateProjectID = async () => {
-    const lastProject = await projectModel.findOne().sort({ createdAt: -1 });
+    const lastProject = await projectModel.findOne();
     if (!lastProject) return 'p1';
     const lastID = lastProject.projectId;  
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] UnaryOperator
Backend/controllers/projectController.js:5:72
 
 //for unique project id
 const generateProjectID = async () => {
-    const lastProject = await projectModel.findOne().sort({ createdAt: -1 });
+    const lastProject = await projectModel.findOne().sort({ createdAt: +1 });
     if (!lastProject) return 'p1';
     const lastID = lastProject.projectId;  
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/projectController.js:6:9
 //for unique project id
 const generateProjectID = async () => {
     const lastProject = await projectModel.findOne().sort({ createdAt: -1 });
-    if (!lastProject) return 'p1';
+    if (false) return 'p1';
     const lastID = lastProject.projectId;  
     const lastNumber = parseInt(lastID.substring(1), 10); 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BooleanLiteral
Backend/controllers/projectController.js:6:9
 //for unique project id
 const generateProjectID = async () => {
     const lastProject = await projectModel.findOne().sort({ createdAt: -1 });
-    if (!lastProject) return 'p1';
+    if (lastProject) return 'p1';
     const lastID = lastProject.projectId;  
     const lastNumber = parseInt(lastID.substring(1), 10); 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] MethodExpression
Backend/controllers/projectController.js:8:33
     const lastProject = await projectModel.findOne().sort({ createdAt: -1 });
     if (!lastProject) return 'p1';
     const lastID = lastProject.projectId;  
-    const lastNumber = parseInt(lastID.substring(1), 10); 
+    const lastNumber = parseInt(lastID, 10); 
     return `p${lastNumber+1}`;
 };
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Timeout] ArithmeticOperator
Backend/controllers/projectController.js:9:16
     if (!lastProject) return 'p1';
     const lastID = lastProject.projectId;  
     const lastNumber = parseInt(lastID.substring(1), 10); 
-    return `p${lastNumber+1}`;
+    return `p${lastNumber - 1}`;
 };
 

[Killed] StringLiteral
Backend/controllers/projectController.js:9:12
     if (!lastProject) return 'p1';
     const lastID = lastProject.projectId;  
     const lastNumber = parseInt(lastID.substring(1), 10); 
-    return `p${lastNumber+1}`;
+    return ``;
 };
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/projectController.js:15:45
 // Upload new project Details
 async function handleProjectUpload(req,res){
     try {
-        const newProject = new projectModel({
-          projectId: await generateProjectID(),
-          title: req.body.title,
-          description: req.body.description,
-          teamManager: req.body.teamManager, 
-          teamMembers: req.body.teamMembers.map(member => ({ id: member.id})),
-      
-          status: req.body.status,
-       
-          tasks: req.body.tasks 
-          .map(task => ({
-            taskTitle: task.taskTitle,
-            taskDescription: task.taskDescription,
-            assignedTo: {
-              id: task.assignedTo.id 
-            },
-            dueDate: task.dueDate,
-            status: task.status,
-          })),
-          startDate: req.body.startDate,
-          endDate: req.body.endDate,
-          createdAt: new Date()
-        });
+        const newProject = new projectModel({});
         // console.log(newProject);
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ArrowFunction
Backend/controllers/projectController.js:20:49
           title: req.body.title,
           description: req.body.description,
           teamManager: req.body.teamManager, 
-          teamMembers: req.body.teamMembers.map(member => ({ id: member.id})),
+          teamMembers: req.body.teamMembers.map(() => undefined),
       
           status: req.body.status,
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ArrowFunction
Backend/controllers/projectController.js:25:16
           status: req.body.status,
        
           tasks: req.body.tasks 
-          .map(task => ({
-            taskTitle: task.taskTitle,
-            taskDescription: task.taskDescription,
-            assignedTo: {
-              id: task.assignedTo.id 
-            },
-            dueDate: task.dueDate,
-            status: task.status,
-          })),
+          .map(() => undefined),
           startDate: req.body.startDate,
           endDate: req.body.endDate,
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/projectController.js:28:25
           .map(task => ({
             taskTitle: task.taskTitle,
             taskDescription: task.taskDescription,
-            assignedTo: {
-              id: task.assignedTo.id 
-            },
+            assignedTo: {},
             dueDate: task.dueDate,
             status: task.status,
killedBy: Announcement API Tests [Employee] should view announcements addressed to them
statusReason: Auth token is missing.

[Killed] ObjectLiteral
Backend/controllers/projectController.js:42:30
 
         const savedProject = await newProject.save(); 
 
-        res.status(201).send({ status: "true", message: "Project Uploaded Successfully" });
+        res.status(201).send({});
       } catch (error) {
         res.status(400).send({ error: error.message });
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/projectController.js:42:57
 
         const savedProject = await newProject.save(); 
 
-        res.status(201).send({ status: "true", message: "Project Uploaded Successfully" });
+        res.status(201).send({ status: "true", message: "" });
       } catch (error) {
         res.status(400).send({ error: error.message });
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/projectController.js:43:23
         const savedProject = await newProject.save(); 
 
         res.status(201).send({ status: "true", message: "Project Uploaded Successfully" });
-      } catch (error) {
-        res.status(400).send({ error: error.message });
-    }
+      } catch (error) {}
       
 }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/projectController.js:52:44
 
 
 // get all list of peoject details
-async function handleGetAllProject(req,res){
-    const { managerID } = req.params;  
-      try {
-        let projects = await projectModel.find({ 'teamManager.id':  managerID });
-  
-          if (!projects) return res.status(404).send({ message: 'Project not found' });
-
-          // console.log(projects)
-        
-        if(managerID == '2024000001'){
-            projects = await projectModel.find();
-        }
-        // console.log("prd is: ",projects)
-          res.status(200).send({status:"true" , projects});
-      } catch (error) {
-          res.status(500).send({ error: error.message });
-      }
-  
-}
+async function handleGetAllProject(req,res){}
 
 // get perticuler project 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/projectController.js:54:11
 // get all list of peoject details
 async function handleGetAllProject(req,res){
     const { managerID } = req.params;  
-      try {
-        let projects = await projectModel.find({ 'teamManager.id':  managerID });
-  
-          if (!projects) return res.status(404).send({ message: 'Project not found' });
-
-          // console.log(projects)
-        
-        if(managerID == '2024000001'){
-            projects = await projectModel.find();
-        }
-        // console.log("prd is: ",projects)
-          res.status(200).send({status:"true" , projects});
-      } catch (error) {
+      try {} catch (error) {
           res.status(500).send({ error: error.message });
       }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/projectController.js:57:15
       try {
         let projects = await projectModel.find({ 'teamManager.id':  managerID });
   
-          if (!projects) return res.status(404).send({ message: 'Project not found' });
+          if (true) return res.status(404).send({ message: 'Project not found' });
 
           // console.log(projects)
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BooleanLiteral
Backend/controllers/projectController.js:57:15
       try {
         let projects = await projectModel.find({ 'teamManager.id':  managerID });
   
-          if (!projects) return res.status(404).send({ message: 'Project not found' });
+          if (projects) return res.status(404).send({ message: 'Project not found' });
 
           // console.log(projects)
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/projectController.js:61:12
 
           // console.log(projects)
         
-        if(managerID == '2024000001'){
+        if(false){
             projects = await projectModel.find();
         }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] EqualityOperator
Backend/controllers/projectController.js:61:12
 
           // console.log(projects)
         
-        if(managerID == '2024000001'){
+        if(managerID != '2024000001'){
             projects = await projectModel.find();
         }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/projectController.js:66:23
         }
         // console.log("prd is: ",projects)
           res.status(200).send({status:"true" , projects});
-      } catch (error) {
-          res.status(500).send({ error: error.message });
-      }
+      } catch (error) {}
   
 }
killedBy: Announcement API Tests [Admin] should fail to post an announcement with missing message
statusReason: Auth token is missing.

[Killed] ObjectLiteral
Backend/controllers/projectController.js:67:32
         // console.log("prd is: ",projects)
           res.status(200).send({status:"true" , projects});
       } catch (error) {
-          res.status(500).send({ error: error.message });
+          res.status(500).send({});
       }
   
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/projectController.js:73:51
 }
 
 // get perticuler project 
-async function handleGetPerticulerProject(req,res){
-    try {
-        const project = await projectModel.findOne({ projectID: req.params.id });
-
-        if (!project) return res.status(404).send({ message: 'Project not found' });
-
-        res.status(200).send({status:"true" , projectDetail: project});
-    } catch (error) {
-        res.status(500).send({ error: error.message });
-    }
-}
+async function handleGetPerticulerProject(req,res){}
 
 // update project detail
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/projectController.js:74:9
 
 // get perticuler project 
 async function handleGetPerticulerProject(req,res){
-    try {
-        const project = await projectModel.findOne({ projectID: req.params.id });
-
-        if (!project) return res.status(404).send({ message: 'Project not found' });
-
-        res.status(200).send({status:"true" , projectDetail: project});
-    } catch (error) {
+    try {} catch (error) {
         res.status(500).send({ error: error.message });
     }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/projectController.js:75:52
 // get perticuler project 
 async function handleGetPerticulerProject(req,res){
     try {
-        const project = await projectModel.findOne({ projectID: req.params.id });
+        const project = await projectModel.findOne({});
 
         if (!project) return res.status(404).send({ message: 'Project not found' });
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/projectController.js:77:13
     try {
         const project = await projectModel.findOne({ projectID: req.params.id });
 
-        if (!project) return res.status(404).send({ message: 'Project not found' });
+        if (true) return res.status(404).send({ message: 'Project not found' });
 
         res.status(200).send({status:"true" , projectDetail: project});
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BooleanLiteral
Backend/controllers/projectController.js:77:13
     try {
         const project = await projectModel.findOne({ projectID: req.params.id });
 
-        if (!project) return res.status(404).send({ message: 'Project not found' });
+        if (project) return res.status(404).send({ message: 'Project not found' });
 
         res.status(200).send({status:"true" , projectDetail: project});
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/projectController.js:79:38
 
         if (!project) return res.status(404).send({ message: 'Project not found' });
 
-        res.status(200).send({status:"true" , projectDetail: project});
+        res.status(200).send({status:"" , projectDetail: project});
     } catch (error) {
         res.status(500).send({ error: error.message });
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/projectController.js:79:30
 
         if (!project) return res.status(404).send({ message: 'Project not found' });
 
-        res.status(200).send({status:"true" , projectDetail: project});
+        res.status(200).send({});
     } catch (error) {
         res.status(500).send({ error: error.message });
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/projectController.js:80:21
         if (!project) return res.status(404).send({ message: 'Project not found' });
 
         res.status(200).send({status:"true" , projectDetail: project});
-    } catch (error) {
-        res.status(500).send({ error: error.message });
-    }
+    } catch (error) {}
 }
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/projectController.js:88:8
 // update project detail
 async function handleUpdateProjectDetail(req,res){
 
-    try{
-      const projectId = req.params.projectID;
-      const projectData = req.body;
-      // console.log(projectId,projectData)
-      const updatedProject = await projectModel.findOneAndUpdate(
-        { projectId: projectId },
-          projectData,
-          { new: true }
-      );
-      
-      if (!updatedProject) {
-          return res.status(404).json({ message: "Project not found" });
-      }
-
-      return res.status(200).json({
-          message: "Project updated successfully",
-          updatedProject
-      });
-
-    } catch(error) {
+    try{} catch(error) {
       console.error("Error updating project:", error);
       return res.status(500).json({ message: "Server error" });
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/projectController.js:93:9
       const projectData = req.body;
       // console.log(projectId,projectData)
       const updatedProject = await projectModel.findOneAndUpdate(
-        { projectId: projectId },
+        {},
           projectData,
           { new: true }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BooleanLiteral
Backend/controllers/projectController.js:95:18
       const updatedProject = await projectModel.findOneAndUpdate(
         { projectId: projectId },
           projectData,
-          { new: true }
+          { new: false }
       );
       
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/projectController.js:98:28
           { new: true }
       );
       
-      if (!updatedProject) {
-          return res.status(404).json({ message: "Project not found" });
-      }
+      if (!updatedProject) {}
 
       return res.status(200).json({
killedBy: Announcement API Tests [Admin] should fail to post an announcement with missing message
statusReason: Auth token is missing.

[Killed] ConditionalExpression
Backend/controllers/projectController.js:98:11
           { new: true }
       );
       
-      if (!updatedProject) {
+      if (true) {
           return res.status(404).json({ message: "Project not found" });
       }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/projectController.js:99:50
       );
       
       if (!updatedProject) {
-          return res.status(404).json({ message: "Project not found" });
+          return res.status(404).json({ message: "" });
       }
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/projectController.js:99:39
       );
       
       if (!updatedProject) {
-          return res.status(404).json({ message: "Project not found" });
+          return res.status(404).json({});
       }
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/projectController.js:107:20
           updatedProject
       });
 
-    } catch(error) {
-      console.error("Error updating project:", error);
-      return res.status(500).json({ message: "Server error" });
-    }
+    } catch(error) {}
 }
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/projectController.js:108:21
       });
 
     } catch(error) {
-      console.error("Error updating project:", error);
+      console.error("", error);
       return res.status(500).json({ message: "Server error" });
     }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ObjectLiteral
Backend/controllers/projectController.js:109:35
 
     } catch(error) {
       console.error("Error updating project:", error);
-      return res.status(500).json({ message: "Server error" });
+      return res.status(500).json({});
     }
 }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/projectController.js:114:44
 }
 
 // delete existing project
-async function handleDeleteProject(req,res){
-    // console.log("projectId: ",req.params.projectID);
-    try {
-        const deletedProject = await projectModel.findOneAndDelete({ projectId: req.params.projectID });
-        if (!deletedProject) return res.status(404).json({ message: 'Project not found' });
-        const updatedProjects = await projectModel.find({});
-
-        res.status(200).send({ status:"true",
-          message: 'Project deleted successfully',
-          projects: updatedProjects});
-          
-    } catch (error) {
-        res.status(500).send({ error: error.message });
-    }
-}
+async function handleDeleteProject(req,res){}
 
 //Assign project return By id
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/projectController.js:116:9
 // delete existing project
 async function handleDeleteProject(req,res){
     // console.log("projectId: ",req.params.projectID);
-    try {
-        const deletedProject = await projectModel.findOneAndDelete({ projectId: req.params.projectID });
-        if (!deletedProject) return res.status(404).json({ message: 'Project not found' });
-        const updatedProjects = await projectModel.find({});
-
-        res.status(200).send({ status:"true",
-          message: 'Project deleted successfully',
-          projects: updatedProjects});
-          
-    } catch (error) {
+    try {} catch (error) {
         res.status(500).send({ error: error.message });
     }
killedBy: Announcement API Tests [Admin] should fail to post an announcement with missing message
statusReason: Auth token is missing.

[Killed] ConditionalExpression
Backend/controllers/projectController.js:118:13
     // console.log("projectId: ",req.params.projectID);
     try {
         const deletedProject = await projectModel.findOneAndDelete({ projectId: req.params.projectID });
-        if (!deletedProject) return res.status(404).json({ message: 'Project not found' });
+        if (true) return res.status(404).json({ message: 'Project not found' });
         const updatedProjects = await projectModel.find({});
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] ConditionalExpression
Backend/controllers/projectController.js:118:13
     // console.log("projectId: ",req.params.projectID);
     try {
         const deletedProject = await projectModel.findOneAndDelete({ projectId: req.params.projectID });
-        if (!deletedProject) return res.status(404).json({ message: 'Project not found' });
+        if (false) return res.status(404).json({ message: 'Project not found' });
         const updatedProjects = await projectModel.find({});
 
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/projectController.js:122:20
         const updatedProjects = await projectModel.find({});
 
         res.status(200).send({ status:"true",
-          message: 'Project deleted successfully',
+          message: "",
           projects: updatedProjects});
           
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/projectController.js:131:45
 }
 
 //Assign project return By id
-async function handleAssignProjects(req,res){
-  const { employeeID } = req.params;  
-  try {
-  const projects = await projectModel.find({
-    teamMembers: { $elemMatch: { id: employeeID } },  
-  });
-
-  if (!projects || projects.length === 0) {
-    return res.status(404).json({ message: "No projects assigned to this employee." });
-  }
-  res.status(200).json({
-      success: true,
-      projects,
-    });
-  } catch (error) {
-    console.error("Error fetching projects for employee:", error.message);
-    res.status(500).json({
-      success: false,
-      message: "An error occurred while fetching projects.",
-    });
-  }
-}
+async function handleAssignProjects(req,res){}
   
 module.exports = {
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/projectController.js:133:7
 //Assign project return By id
 async function handleAssignProjects(req,res){
   const { employeeID } = req.params;  
-  try {
-  const projects = await projectModel.find({
-    teamMembers: { $elemMatch: { id: employeeID } },  
-  });
-
-  if (!projects || projects.length === 0) {
-    return res.status(404).json({ message: "No projects assigned to this employee." });
-  }
-  res.status(200).json({
-      success: true,
-      projects,
-    });
-  } catch (error) {
+  try {} catch (error) {
     console.error("Error fetching projects for employee:", error.message);
     res.status(500).json({
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] EqualityOperator
Backend/controllers/projectController.js:138:20
     teamMembers: { $elemMatch: { id: employeeID } },  
   });
 
-  if (!projects || projects.length === 0) {
+  if (!projects || projects.length !== 0) {
     return res.status(404).json({ message: "No projects assigned to this employee." });
   }
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] BlockStatement
Backend/controllers/projectController.js:138:43
     teamMembers: { $elemMatch: { id: employeeID } },  
   });
 
-  if (!projects || projects.length === 0) {
-    return res.status(404).json({ message: "No projects assigned to this employee." });
-  }
+  if (!projects || projects.length === 0) {}
   res.status(200).json({
       success: true,
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Killed] StringLiteral
Backend/controllers/projectController.js:139:44
   });
 
   if (!projects || projects.length === 0) {
-    return res.status(404).json({ message: "No projects assigned to this employee." });
+    return res.status(404).json({ message: "" });
   }
   res.status(200).json({
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.
