[Killed] ObjectLiteral
Backend/controllers/projectController.js:141:24
   if (!projects || projects.length === 0) {
     return res.status(404).json({ message: "No projects assigned to this employee." });
   }
-  res.status(200).json({
-      success: true,
-      projects,
-    });
+  res.status(200).json({});
   } catch (error) {
     console.error("Error fetching projects for employee:", error.message);
killedBy: Admin Routes [Admin] should retrieve all employee details with profiles
statusReason: Auth token is missing. Admin login test may have failed.

[Survived] BlockStatement
Backend/controllers/projectController.js:145:19
       success: true,
       projects,
     });
-  } catch (error) {
-    console.error("Error fetching projects for employee:", error.message);
-    res.status(500).json({
-      success: false,
-      message: "An error occurred while fetching projects.",
-    });
-  }
+  } catch (error) {}
 }
   
